{
  "stories": [
    {
      "id": "cleopatra-the-last-pharaoh",
      "title_en": "Cleopatra: The Last Pharaoh",
      "title_ar": "كلیوباترا الفرعون الأخیر",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Cleopatra VII was the last pharaoh of Egypt and one of the most remarkable leaders in ancient history. She formed strategic alliances with Rome to protect her nation.",
      "content_ar": "كانت كلیوباترا السابعة آخر فراعنة مصر وأحد أعظم القادة في التاریخ القدیم. عُرفت بذكائھا الحاد وجاذبیتھا القویة، كما كانت تتحدث عدة لغات بطلاقة، مما ساعدھا في المفاوضات السیاسیة. سعت لحمایة مصر من التوسع الروماني، فشكّلت تحالفات استراتیجیة، أولاً مع یولیوس قیصر،\n\nثم مع مارك أنطوني، مما منحھا قوة سیاسیة كبیرة. لكن بعد ھزیمة أنطوني في معركة أكتیوم، ضعفت مكانتھا. في . النھایة، بعد سقوط الإسكندریة، اختارت إنھاء حیاتھا بنفسھا بطریقة لا تزال غامضة،",
      "content_en": "Cleopatra VII was the last pharaoh of Egypt and one of the most remarkable leaders in ancient history. She was highly intelligent, spoke multiple languages fluently, and mastered the art of political negotiation.\n\nTo protect Egypt from Roman expansion, she formed strategic alliances—first with Julius Caesar and later with Mark Antony—gaining significant influence. However, after Antony’s defeat at the Battle of Actium, her power diminished.",
      "audioArMale": "data/audio/nonfiction/nonfiction_cleopatra-the-last-pharaoh_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_cleopatra-the-last-pharaoh_ar_female.mp3"
    },
    {
      "id": "leonardo-da-vinci-the-renaissance-man",
      "title_en": "Leonardo da Vinci: The Renaissance Man",
      "title_ar": "لیوناردو دا فینشي: عبقري عصر النھضة",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Leonardo da Vinci was a multifaceted genius known for his art, inventions, and visionary ideas that transcended his time.",
      "content_ar": "لیوناردو دا فینشي لم یكن مجرد رسام، بل كان عبقریًا متعدد المواھب. درس التشریح بدقة لیجعل رسوماتھ أكثر واقعیة، وابتكر تصامیم لآلات طائرة قبل قرون من اختراع الطیران.\n\nبجانب تحفتھ الفنیة \"المونالیزا\", رسم \"العشاء الأخیر\", وھي من أعظم اللوحات الدینیة في التاریخ. لم تقتصر عبقریتھ على الفن، بل امتدت إلى الھندسة والفیزیاء، حیث صمّم أسلحة وآلات مبتكرة.",
      "content_en": "Leonardo da Vinci was not just a painter; he was a true genius with diverse talents. He studied anatomy extensively to make his art more lifelike and designed flying machines centuries before aviation was invented.\n\nBeyond his masterpiece, the Mona Lisa, he also painted The Last Supper, one of the most famous religious paintings in history. His genius extended to engineering and physics, where he sketched designs for innovative weapons and machines.",
      "audioArMale": "data/audio/nonfiction/nonfiction_leonardo-da-vinci-the-renaissance-man_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_leonardo-da-vinci-the-renaissance-man_ar_female.mp3"
    },
    {
      "id": "elizabeth-i-the-virgin-queen",
      "title_en": "Elizabeth I: The Virgin Queen",
      "title_ar": "إلیزابیث الأولى: الملكة العذراء",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Elizabeth I was a formidable queen who led England during the prosperous Elizabethan Era and secured its naval dominance.",
      "content_ar": "كانت الملكة إلیزابیث الأولى واحدة من أعظم حكام إنجلترا، إذ قادت البلاد خلال \"العصر الإلیزابیثي\", فترة شھدت ازدھارًا ثقافیًا وعسكریًا. وُلدت عام ،1533 وكانت ابنة الملك ھنري الثامن والملكة آن بولین. بعد طفولة مضطربة وإعدام والدتھا، أصبحت ملكة . عام 1558 بعد وفاة أختھا، ماري الأولى واجھت إلیزابیث تھدیدات داخلیة وخارجیة، لكنھا نجحت في تعزیز استقرار البلاد.\n\nمن أبرز إنجازاتھا ھزیمة الأسطول الإسباني عام ،1588 مما رسّخ مكانة إنجلترا كقوة بحریة عظمى. خلال حكمھا، ازدھر الأدب والفن، وشھدت البلاد عصرًا ذھبیًا بفضل شخصیات مثل. ویلیام شكسبیر وكریستوفر مارلو عُرفت بلقب \"الملكة العذراء\" لأنھا لم تتزوج أبدًا، مفضلةً التركیز على حكمھا بدلاً من مشاركة السلطة. بحكمتھا ودھائھا، وحّدت المملكة وأثبتت أن المرأة یمكنھا أن تحكم بصلابة ونجاح. عند وفاتھا عام ،1603 تركت إرثًا من الاستقرار والازدھار الذي استمر .",
      "content_en": "Queen Elizabeth I was one of England’s greatest rulers, leading the nation through the prosperous Elizabethan Era.\n\nBorn in 1533, her early years were marred by political turmoil and personal tragedies. Despite facing numerous threats, both domestic and foreign, she successfully maintained stability and secured England’s naval dominance, notably defeating the Spanish Armada in 1588.",
      "audioArMale": "data/audio/nonfiction/nonfiction_elizabeth-i-the-virgin-queen_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_elizabeth-i-the-virgin-queen_ar_female.mp3"
    },
    {
      "id": "frederick-douglass-the-voice-of-freedom",
      "title_en": "Frederick Douglass: The Voice of Freedom",
      "title_ar": "فریدریك دوغلاس: صوت الحریة",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Frederick Douglass was a former slave who became a powerful orator and leading figure in the abolitionist movement, advocating for freedom and equality.",
      "content_ar": "وُلد فریدریك دوغلاس عام 1818 في العبودیة بولایة ماریلاند الأمریكیة، لكنھ رفض أن یكون عبدًا للأبد. رغم القوانین الصارمة التي منعت العبید من التعلم، تحدّى دوغلاس ھذه القیود وعلم نفسھ القراءة والكتابة سرًا، مما منحھ القوة لیطالب بحریتھ. في عام ،1838 ھرب إلى.\n\nالشمال متنكّرًا، حیث بدأ حیاة جدیدة كرجل حر وانضم إلى حركة إلغاء العبودیة بفضل خطابھ القوي وكلماتھ المؤثرة، أصبح دوغلاس أحد أشھر المتحدثین ضد العبودیة في الولایات المتحدة.\n\nنشر سیرتھ الذاتیة \"روایة حیاة فریدریك دوغلاس، عبد ,أمریكي\" التي كشفت قسوة العبودیة وجعلتھ شخصیة مشھورة في أمریكا وأوروبا. كان لقلمھ القوي وخطاباتھ.\n\nأثر كبیر في توعیة الناس بمعاناة المستعبدین لم یكن نضالھ مقتصرًا على تحریر العبید، بل دافع أیضًا عن حقوق المرأة والمساواة العرقیة والتعلیم للجمیع. خلال الحرب الأھلیة الأمریكیة، عمل كمستشار للرئیس أبراھام لینكولن وساعد في تجنید الجنود السود للقتال من أجل الحریة. بعد الحرب، واصل جھوده لإرساء.",
      "content_en": "Frederick Douglass was born into slavery in Maryland in 1818, but he refused to accept a life of bondage. Despite harsh laws preventing enslaved people from learning, he secretly taught himself to read and write, recognizing that knowledge was the key to freedom.\n\nIn 1838, he escaped to the North, disguising himself, and began a new life as a free man, quickly becoming a powerful voice in the abolitionist movement. His eloquent speeches and writings exposed the brutal realities of slavery, inspiring change and advancing the fight for civil rights. Douglass also became a staunch advocate for women’s rights and racial equality, advising President Abraham Lincoln during the Civil War.",
      "audioArMale": "data/audio/nonfiction/nonfiction_frederick-douglass-the-voice-of-freedom_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_frederick-douglass-the-voice-of-freedom_ar_female.mp3"
    },
    {
      "id": "marie-curie-the-pioneer-of-science",
      "title_en": "Marie Curie: The Pioneer of Science",
      "title_ar": "ماري كوري: رائدة العلم",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Marie Curie was a groundbreaking scientist who made pioneering discoveries in radioactivity, winning Nobel Prizes in both Physics and Chemistry.",
      "content_ar": "وُلدت ماري كوري عام 1867 في وارسو، بولندا، وكانت منذ صغرھا شغوفة بالعلوم. في وقت لم یكن یُسمح فیھ للنساء بسھولة بدراسة . العلوم، انتقلت إلى باریس للالتحاق بجامعة السوربون، حیث درست الفیزیاء والكیمیاء في مختبرھا، إلى جانب زوجھا بییر كوري، بدأت في دراسة النشاط الإشعاعي، وھو مصطلح صاغتھ بنفسھا. تمكنت من اكتشاف عنصرین جدیدین: البولونیوم، الذي سمّتھ على اسم وطنھا، والرادیوم،\n\nالذي أحدث ثورة في الطب والفیزیاء. بفضل أبحاثھا، أصبحت أول . امرأة تفوز بجائزة نوبل، ولم تكتفِ بذلك، بل حصلت لاحقًا على جائزة نوبل ثانیة، لتكون أول شخص یفوز بھا في مجالین مختلفین لكن عملھا كان لھ ثمن. التعرض الطویل للإشعاع أثّر على صحتھا، وأدى في النھایة إلى وفاتھا عام .1934 رغم ذلك، غیرت أبحاثھا العالم، ومھّدت الطریق لعلاجات السرطان باستخدام العلاج الإشعاعي. الیوم، تُعتبر ماري كوري رمزًا للمرأة في العلوم، وأحد أعظم .",
      "content_en": "Marie Curie was born in 1867 in Warsaw, Poland, and showed an early passion for science. At a time when women had limited access to higher education, she moved to Paris to study physics and chemistry at the Sorbonne.\n\nIn her laboratory, alongside her husband Pierre Curie, she began pioneering research on radioactivity—a term she coined herself. Through tireless experiments, she discovered two new elements: polonium, named after her homeland, and radium, which revolutionized medicine and physics. Her groundbreaking work earned her the Nobel Prize in Physics, making her the first woman ever to receive the honor.",
      "audioArMale": "data/audio/nonfiction/nonfiction_marie-curie-the-pioneer-of-science_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_marie-curie-the-pioneer-of-science_ar_female.mp3"
    },
    {
      "id": "malcolm-x-the-activists-journey",
      "title_en": "Malcolm X: The Activist’s Journey",
      "title_ar": "مالكوم إكس: رحلة ناشط",
      "genre": "Non-Fiction",
      "sub_genre": "Biographies",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Malcolm X was a prominent civil rights activist whose journey from a troubled youth to a leader in the Nation of Islam reshaped the fight for racial justice.",
      "content_ar": "وُلد مالكوم إكس عام 1925 في أوماھا، نبراسكا، ونشأ في بیئة صعبة ملیئة بالتمییز العنصري. قتُل والده في حادث غامض، وتعرضت . أسرتھ لمضایقات متكررة. بعد فترة من التورط في الجریمة، سُجن وھو في العشرینیات من عمره، وھناك بدأ تحولھ الفكري في السجن، تعرف على تعالیم أمة الإسلام، وبدأ في تثقیف نفسھ، وأصبح متحدثًا بلیغًا.\n\nبعد خروجھ، أصبح من أبرز القادة في المنظمة، حیث دعا إلى الاستقلالیة السوداء ورفض الاندماج القسري مع المجتمع الأبیض. كانت خطبھ الناریة ورسائلھ المباشرة سببًا في شھرتھ، . لكنھ لاحقًا بدأ یشكك في بعض تعالیم أمة الإسلام، خاصة بعد أدائھ الحج إلى مكة، حیث رأى وحدة المسلمین من مختلف الأعراق بعد تركھ أمة الإسلام، أسس منظمة جدیدة وسعى لنشر رسالة أكثر شمولیة عن حقوق الإنسان. لكن في عام ،1965 تم اغتیالھ في نیویورك أثناء إلقائھ خطابًا. رغم حیاتھ القصیرة، أثّر في النضال من أجل الحقوق المدنیة، ولا یزال صوتھ مصدر إلھام للحركات الداعیة .",
      "content_en": "Malcolm X was born in 1925 in Omaha, Nebraska, and faced racial discrimination from an early age. His father was killed under suspicious circumstances, and his family endured constant threats. Falling into crime as a young man, he was imprisoned in his early twenties—a turning point in his life.\n\nWhile in prison, he was introduced to the teachings of the Nation of Islam, which emphasized Black empowerment and self-reliance. After his release, he emerged as a powerful orator and became one of the most influential leaders of the Nation of Islam. Following a transformative pilgrimage to Mecca, he began advocating for racial unity and broader human rights.",
      "audioArMale": "data/audio/nonfiction/nonfiction_malcolm-x-the-activists-journey_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_malcolm-x-the-activists-journey_ar_female.mp3"
    },
    {
      "id": "the-power-of-one-habit",
      "title_en": "The Power of One Habit",
      "title_ar": "قوة العادة الواحدة",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A small habit can lead to massive changes in your life by planting the seeds of transformation through consistent daily actions.",
      "content_ar": "یمكن أن تؤدي عادة صغیرة إلى تغییرات ھائلة في حیاتك. عندما تلتزم بإجراء بسیط یومیًا، مثل الاستیقاظ مبكرًا، أو شرب المزید من الماء، أو القراءة لمدة خمس دقائق، فإنك تزرع بذور التحول الكبیر.\n\nالسر یكمن في الاستمراریة، فالعادات الصغیرة تتراكم بمرور الوقت لتحدث تأثیرًا دائمًا. بدلاً من محاولة تغییر كل شيء دفعة واحدة، ركّز على تحسین جانب واحد من یومك، وستندھش من النتائج. خطوة .",
      "content_en": "A small habit can lead to massive changes in your life. When you commit to a simple daily action—such as waking up early, drinking more water, or reading for five minutes—you plant the seeds of transformation.\n\nThe key is consistency, as small habits accumulate over time to create lasting impact. Instead of trying to change everything at once, focus on improving just one part of your day, and you’ll be amazed at the results.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-power-of-one-habit_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-power-of-one-habit_ar_female.mp3"
    },
    {
      "id": "the-gratitude-journal",
      "title_en": "The Gratitude Journal",
      "title_ar": "مفكرة الامتنان",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Writing a daily gratitude journal can boost your mood and shift your focus from negatives to positives.",
      "content_ar": "تخصیص بضع دقائق یومیًا لكتابة الأمور التي تشعر بالامتنان لھا یمكن أن یحسن حالتك المزاجیة ویزید من سعادتك. یمكن أن یكون الامتنان لأي شيء بسیط، مثل لحظة جمیلة عشتھا، أو شخص دعمك، أو حتى كوب قھوة لذیذ.\n\nتساعدك ھذه العادة على التركیز على الإیجابیات بدلاً من السلبیات، مما یعزز رفاھیتك العاطفیة. ابدأ بكتابة ثلاثة أشیاء یومیًا، وستلاحظ كیف تصبح أكثر تفاؤلاً وإیجابیة مع . مرور الوقت.",
      "content_en": "Taking just a few minutes each day to write down what you’re grateful for can improve your mood and boost happiness. Gratitude can be for anything simple—a beautiful moment, someone who supported you, or even a delicious cup of coffee.\n\nThis habit helps shift your focus from negatives to positives, enhancing emotional well-being. Start by writing down three things each day, and over time, you’ll notice yourself becoming more optimistic and positive.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-gratitude-journal_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-gratitude-journal_ar_female.mp3"
    },
    {
      "id": "overcoming-procrastination",
      "title_en": "Overcoming Procrastination",
      "title_ar": "التغلب على التسویف",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Procrastination can hinder productivity, but simple techniques like the 2-minute rule and time-blocking can help overcome it.",
      "content_ar": "التسویف مشكلة شائعة تؤثر على الإنتاجیة وتؤدي إلى تراكم المھام والضغط النفسي. إحدى الطرق الفعالة للتغلب علیھ ھي قاعدة الدقیقتین،\n\nوالتي تنص على أنھ إذا كانت المھمة تستغرق أقل من دقیقتین، فقم بھا فورًا بدلاً من تأجیلھا. یساعدك ھذا على التخلص من .",
      "content_en": "Procrastination is a common issue that affects productivity, leading to stress and unfinished tasks. One simple way to beat it is the 2-minute rule, which states that if a task takes less than two minutes, do it immediately instead of postponing it. This helps clear small tasks before they pile up.\n\nAnother effective method is time-blocking, where you allocate specific time slots in your schedule for different tasks, making you more accountable and reducing distractions. The key is identifying the root cause of procrastination—whether it’s fear of failure, burnout, or lack of clarity. Once you understand why you’re delaying tasks, you can take targeted steps to overcome it.",
      "audioArMale": "data/audio/nonfiction/nonfiction_overcoming-procrastination_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_overcoming-procrastination_ar_female.mp3"
    },
    {
      "id": "setting-smart-goals",
      "title_en": "Setting SMART Goals",
      "title_ar": "تحدید الأھداف الذكیة",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Setting goals using the SMART criteria—Specific, Measurable, Achievable, Relevant, and Time-bound—can greatly enhance your chances of success.",
      "content_ar": "والتي تعني أن یكون الھدف محددًا SMART،  وضع الأھداف بشكل صحیح ھو مفتاح النجاح، وأفضل طریقة لذلك ھي استخدام معاییر (Relevant)،  ومرتبطًا باحتیاجاتك (Achievable)،  وقابلا ًللتحقیق (Measurable)،  وقابلا ًللقیاس (Specific)، على سبیل المثال، بدلاً من قول \"أرید أن أصبح أكثر صحة\"،\n\nیمكنك تحدید ھدف ذكي كالتالي: \"سأمشي 30 دقیقة یومیًا، خمسة أیام في (Time-bound).  ومحددًا بوقت زمني . الأسبوع، لمدة شھر\". ھذا الھدف محدد، یمكن قیاسھ، واقعي،",
      "content_en": "Setting goals correctly is the key to success, and the best approach is using the SMART criteria, meaning your goal should be Specific, Measurable, Achievable, Relevant, and Time-bound. For example, instead of saying, 'I want to be healthier,' a SMART goal would be: 'I will walk for 30 minutes a day, five days a week, for the next month.' This goal is clear, measurable, realistic, and has a defined timeline.\n\nBreaking big goals into smaller steps makes them more manageable and increases motivation. Regularly reviewing progress helps you adjust and stay on track.",
      "audioArMale": "data/audio/nonfiction/nonfiction_setting-smart-goals_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_setting-smart-goals_ar_female.mp3"
    },
    {
      "id": "the-growth-mindset",
      "title_en": "The Growth Mindset",
      "title_ar": "عقلیة النمو",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A growth mindset is the belief that abilities and intelligence can be developed through effort, learning from failure, and embracing challenges.",
      "content_ar": "النجاح لا یعتمد فقط على الموھبة أو الذكاء، بل على الطریقة التي ننظر بھا إلى التحدیات. وفقًا لعالمة النفس كارول دویك، ھناك نوعان الأشخاص ذوو العقلیة الثابتة یعتقدون Mindset). (Growth  عقلیةو النمو Mindset) (Fixed  من العقلیات: العقلیة الثابتة أن قدراتھم محددة ولا یمكن تغییرھا، بینما یرى أصحاب عقلیة النمو أن الذكاء والمھارات یمكن تطویرھا من خلال الجھد والتعلم .المستمر امتلاك عقلیة النمو یعني أن ترى الفشل كفرصة للتعلم ولیس كدلیل على عدم الكفاءة. عندما تواجھ صعوبة، بدلاً من الاستسلام، اسأل نفسك: \"ما الذي یمكنني تعلمھ من ھذا الموقف؟\" الأفراد الذین یتبنون ھذه العقلیة یسعون دائمًا لاكتساب مھارات جدیدة، یتقبلون التحدیات، .\n\nولا یخافون من التجربة والخطأ لتطویر عقلیة النمو، ابدأ بإعادة صیاغة طریقة تفكیرك. بدلاً من قول \"أنا لست جیدًا في ھذا\"، جرب أن تقول \"أنا لست جیدًا في ھذا بعد، . لكن یمكنني التحسن.\" كما أن إحاطة نفسك بأشخاص إیجابیین والتعلم من الفشل بدلاً من الخوف منھ یساعدان في تبني ھذا النھج في النھایة، النجاح الحقیقي یأتي لأولئك الذین یواصلون التعلم، یواجھون التحدیات بثقة، ویؤمنون بقدرتھم على التطور. عقلیة النمو لیست . مجرد فكرة،",
      "content_en": "Success is not just about talent or intelligence—it’s about how we approach challenges. According to psychologist Carol Dweck, there are two types of mindsets: the fixed mindset and the growth mindset. Those with a fixed mindset believe their abilities are set in stone, while those with a growth mindset see intelligence and skills as qualities that can be developed through effort and continuous learning. Having a growth mindset means viewing failure as an opportunity to learn rather than a reflection of inadequacy.\n\nInstead of giving up when faced with difficulty, ask yourself: 'What can I learn from this situation?' People who adopt this mindset actively seek new skills, embrace challenges, and are not afraid of trial and error. To cultivate a growth mindset, start by reframing your thoughts. Instead of saying, 'I’m not good at this,' say, 'I’m not good at this yet, but I can improve.' Surrounding yourself with positive influences and learning from setbacks instead of fearing them also reinforces this perspective. Ultimately, true success comes to those who continue learning, face challenges with confidence, and believe in their ability to grow.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-growth-mindset_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-growth-mindset_ar_female.mp3"
    },
    {
      "id": "resilience-in-the-face-of-adversity",
      "title_en": "Resilience in the Face of Adversity",
      "title_ar": "الصمود في مواجھة الشدائد",
      "genre": "Non-Fiction",
      "sub_genre": "Self-Help",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Resilience is the ability to recover from setbacks and adapt to challenges, turning adversity into opportunities for growth.",
      "content_ar": "الحیاة ملیئة بالتحدیات، لكن الأشخاص الأقویاء ذھنیًا لا یسمحون للصعوبات بكسرھم، بل یستخدمونھا كفرص للنمو. الصمود ھو القدرة . على التعافي من الفشل، والتكیف مع الظروف الصعبة، والمضي قدمًا رغم العوائق تبدأ القوة الذھنیة بتغییر طریقة التفكیر. بدلاً من رؤیة التحدیات كعقبات، اعتبرھا فرصًا للتعلم والتطور. الأشخاص الذین یتمتعون بالصمود لا ینكرون مشاعرھم، لكنھم لا یسمحون لھا بأن تسیطر علیھم.\n\nیتقبلون الألم، لكنھم یبحثون عن الحلول بدلاً من التركیز على .المشاكل من أھم أسالیب بناء الصمود تنمیة الوعي —التعرفالذاتي على مشاعرك وأفكارك وكیف تؤثر على سلوكك. كما أن بناء شبكة دعم قویة من الأصدقاء والعائلة یساھم في تجاوز الأوقات الصعبة. من الضروري أیضًا تطویر مھارات التأقلم مثل التأمل، وممارسة الریاضة، . ووضع أھداف صغیرة یمكن تحقیقھا للحفاظ على الدافع في النھایة، الصمود لا یعني عدم الشعور بالحزن أو الإحباط، بل یعني القدرة على النھوض بعد السقوط، وإعادة المحاولة رغم . الصعوبات. الأشخاص الأكثر نجاحًا لیسوا من لم یواجھوا الفشل،",
      "content_en": "Life is full of challenges, but mentally strong individuals don’t let hardships break them. Instead, they use adversity as an opportunity for growth. Resilience is the ability to recover from failure, adapt to difficult circumstances, and keep moving forward despite obstacles. Mental strength begins with shifting your mindset. Instead of seeing challenges as roadblocks, view them as opportunities to learn and evolve.\n\nResilient people don’t ignore their emotions, but they also don’t let them take control. They acknowledge pain but focus on solutions rather than problems. One of the key strategies for building resilience is self-awareness—understanding your emotions, thoughts, and how they influence your actions. Another essential factor is having a strong support system of friends and family to rely on during difficult times. Developing coping mechanisms like meditation, exercise, and setting small achievable goals helps maintain motivation and mental clarity.\n\nIn the end, resilience isn’t about avoiding sadness or frustration—it’s about the ability to rise after falling and keep trying despite setbacks.",
      "audioArMale": "data/audio/nonfiction/nonfiction_resilience-in-the-face-of-adversity_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_resilience-in-the-face-of-adversity_ar_female.mp3"
    },
    {
      "id": "the-rise-of-ancient-egypt",
      "title_en": "The Rise of Ancient Egypt",
      "title_ar": "صعود مصر القدیمة",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Ancient Egypt flourished due to the Nile's fertile waters, leading to one of history’s greatest civilizations unified under a powerful monarchy.",
      "content_ar": "ازدھرت الحضارة المصریة القدیمة بفضل نھر النیل، الذي وفر المیاه العذبة والتربة الخصبة للزراعة. منذ حوالي 3100 قبل المیلاد، توحدت مصر تحت حكم الملك مینا، مما أدى إلى ظھور واحدة من أعظم الحضارات في التاریخ. بفضل الفیضانات السنویة للنیل، تمكن المصریون من زراعة المحاصیل بكفاءة،\n\nمما سمح لھم ببناء مدن قویة وتطویر نظام حكم مركزي. كما برعوا في الھندسة، وتركوا لنا أھرامات الجیزة العظیمة، التي لا تزال رمزًا لعبقریتھم. كان الدین والثقافة جزءًا أساسیًا من حیاتھم، حیث عبدوا العدید من الآلھة وابتكروا . نظام كتابة عرف بالھیروغلیفیة،",
      "content_en": "Ancient Egypt flourished thanks to the Nile River, which provided fresh water and fertile soil for farming. Around 3100 BCE, Egypt was unified under King Menes, marking the beginning of one of history’s greatest civilizations.\n\nThe annual flooding of the Nile allowed Egyptians to cultivate crops efficiently, leading to stable food supplies, strong cities, and a centralized government. They excelled in engineering, constructing the magnificent pyramids of Giza, which remain a testament to their ingenuity.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-rise-of-ancient-egypt_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-rise-of-ancient-egypt_ar_female.mp3"
    },
    {
      "id": "the-greek-city-states",
      "title_en": "The Greek City-States",
      "title_ar": "دول المدن الإغریقیة",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Ancient Greece was a collection of city-states, such as Athens and Sparta, that played a crucial role in shaping Western civilization through their unique contributions in democracy, philosophy, and military prowess.",
      "content_ar": "في الیونان القدیمة، لم تكن ھناك دولة موحدة، بل مجموعة من دول ،المدن لكل منھا حكومتھا وثقافتھا. من بین ھذه المدن، برزت أثینا .\n\nوإسبرطة كمركزین قویین لكن متنافسین كانت أثینا تشتھر بالدیمقراطیة والفنون والفلسفة، حیث عاش فیھا فلاسفة عظماء مثل سقراط وأفلاطون. في المقابل، كانت إسبرطة تركز على القوة العسكریة والانضباط، حیث خضع مواطنوھا لتدریب عسكري صارم منذ الصغر. رغم اختلافاتھم،",
      "content_en": "Ancient Greece was not a unified nation but a collection of city-states, each with its own government and culture. Among them, Athens and Sparta stood out as two dominant and rival powers.\n\nAthens was known for its democracy, arts, and philosophy, producing great thinkers like Socrates and Plato. Sparta, on the other hand, was a warrior society, focused on military strength and strict discipline.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-greek-city-states_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-greek-city-states_ar_female.mp3"
    },
    {
      "id": "the-age-of-exploration",
      "title_en": "The Age of Exploration",
      "title_ar": "عصر الاستكشاف",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "During the late 15th and early 16th centuries, European explorers embarked on daring voyages that connected continents and reshaped global trade, despite facing immense challenges.",
      "content_ar": "في أواخر القرن الخامس عشر وأوائل القرن السادس عشر، انطلق البحارة الأوروبیون في رحلات جریئة لاكتشاف أراضٍ جدیدة، . مدفوعین بالرغبة في العثور على طرق تجاریة جدیدة، والتوسع السیاسي،\n\nونشر الدیانة المسیحیة كان كریستوفر كولومبوس أحد أشھر ھؤلاء المستكشفین، حیث أبحر عام 1492 بدعم من ملكي إسبانیا، لیصل إلى جزر الكاریبي معتقدًا أنھ وجد طریقًا جدیدًا إلى آسیا.\n\nأما فردیناند ماجلان، فقد قاد أول رحلة لإكمال الدوران حول العالم بین عامي 1519 ،1522و مما أثبت .\n\nكرویة الأرض وأدى إلى توسیع التجارة العالمیة لم تكن ھذه الرحلات خالیة من التحدیات، فقد واجھ المستكشفون العواصف العنیفة، ونقص الإمدادات، ومواجھات مع السكان الأصلیین. رغم ذلك، أدى عصر الاستكشاف إلى تبادل ثقافي واقتصادي واسع،",
      "content_en": "During the late 15th and early 16th centuries, European sailors embarked on daring voyages to discover new lands, driven by the search for trade routes, political expansion, and the spread of Christianity. Christopher Columbus was one of the most famous explorers, setting sail in 1492 with support from Spain’s monarchy.\n\nHe landed in the Caribbean, mistakenly believing he had found a new route to Asia. Ferdinand Magellan led the first expedition to circumnavigate the globe (1519-1522), proving the Earth’s roundness and expanding global trade. These journeys were fraught with dangers, including violent storms, food shortages, and conflicts with indigenous peoples.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-age-of-exploration_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-age-of-exploration_ar_female.mp3"
    },
    {
      "id": "the-french-revolution",
      "title_en": "The French Revolution",
      "title_ar": "الثورة الفرنسیة",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The French Revolution, beginning in 1789, was a period of radical social and political upheaval in France, fundamentally altering the course of modern history.",
      "content_ar": "اندلعت الثورة الفرنسیة عام ،1789 وكانت واحدة من أكثر الأحداث تأثیرًا في التاریخ الأوروبي. نشأت بسبب عدة عوامل، منھا الأوضاع الاقتصادیة المتدھورة، الضرائب الثقیلة على الطبقة الفقیرة، وعدم المساواة الاجتماعیة،\n\nحیث كانت طبقة النبلاء ورجال الدین . تتمتع بامتیازات كبیرة على حساب عامة الشعب بدأت الثورة عندما اجتمع ممثلو الطبقات المختلفة في اجتماع مجلس الطبقات العامة وطالبوا بإصلاحات. وسرعان ما تطورت الأحداث، حیث اقتحم الثوار سجن الباستیل في 14 یولیو ،1789 وھو حدث أصبح رمزًا للحریة. بعد ذلك، ألُغیت الملكیة عام ،1792 وأعُدم .",
      "content_en": "The French Revolution, which began in 1789, was one of the most significant events in European history. It was driven by economic hardship, heavy taxation on the poor, and social inequality, where the nobility and clergy enjoyed privileges while commoners struggled. The revolution began when representatives of different social classes convened at the Estates-General, demanding reforms.\n\nTensions escalated, leading to the storming of the Bastille on July 14, 1789, a symbolic moment of defiance. Soon after, the monarchy was abolished in 1792, and King Louis XVI was executed in 1793. However, the revolution turned violent during the Reign of Terror (1793-1794), leading to widespread executions.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-french-revolution_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-french-revolution_ar_female.mp3"
    },
    {
      "id": "the-industrial-revolution",
      "title_en": "The Industrial Revolution",
      "title_ar": "الثورة الصناعیة",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Industrial Revolution marked a transformative period in human history, shifting economies from agrarian to industrial through groundbreaking technological innovations.",
      "content_ar": "كانت الثورة الصناعیة، التي بدأت في أواخر القرن الثامن عشر، واحدة من أكبر التحولات الاقتصادیة والاجتماعیة في تاریخ البشریة. أدت الاختراعات والتقنیات الجدیدة، مثل المحرك البخاري، والمصانع الآلیة، والنظم الحدیثة للإنتاج، إلى تحول المجتمعات من . الاقتصادات الزراعیة إلى الاقتصادات الصناعیة بدأت الثورة في بریطانیا، حیث ساھم توفر الفحم والحدید،\n\nإضافة إلى التوسع في التجارة، في تطور الصناعة. تم إنشاء المصانع الكبیرة، مما أدى إلى زیادة الإنتاج وتقلیل الاعتماد على العمل الیدوي. ومع ذلك، لم تكن ھذه التغیرات إیجابیة بالكامل، حیث عانى العمال من . ظروف قاسیة، وساعات عمل طویلة، وأجور منخفضة،",
      "content_en": "The Industrial Revolution, which began in the late 18th century, was one of the most transformative periods in human history. New inventions and technologies—such as the steam engine, mechanized factories, and modern production systems—shifted societies from agrarian economies to industrial powerhouses. It started in Britain, where abundant coal and iron resources, along with expanding trade, fueled rapid industrial growth.\n\nLarge factories emerged, increasing production efficiency while reducing reliance on manual labor. However, this progress came with challenges—workers faced harsh conditions, long hours, and low wages. Urbanization accelerated as people moved from rural areas to industrial cities, leading to overcrowding and poor living conditions.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-industrial-revolution_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-industrial-revolution_ar_female.mp3"
    },
    {
      "id": "the-space-race",
      "title_en": "The Space Race",
      "title_ar": "سباق الفضاء",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Space Race was a Cold War competition between the United States and the Soviet Union, spurring technological advancements and landmark achievements in space exploration.",
      "content_ar": "كان سباق الفضاء خلال القرن العشرین أكثر من مجرد تنافس تقني، فقد كان معركة أیدیولوجیة بین الولایات المتحدة والاتحاد السوفیتي،\n\n.\n\nحیث سعى كلا الطرفین لإثبات تفوقھ العلمي والتكنولوجي خلال الحرب الباردة بدأ السباق فعلیًا في عام 1957 عندما أطلق الاتحاد السوفیتي القمر الصناعي سبوتنیك ،1 وھو أول جسم من صنع الإنسان یدور حول الأرض. شكل ھذا الإنجاز صدمة كبیرة للولایات المتحدة، مما دفعھا إلى تعزیز برامجھا الفضائیة.",
      "content_en": "The Space Race in the 20th century was more than a technological contest—it was an ideological battle between the United States and the Soviet Union during the Cold War.\n\nThe race officially began in 1957 when the Soviet Union launched Sputnik 1, the first human-made satellite, which shocked the United States and spurred rapid advancements in space technology. In 1961, Yuri Gagarin became the first human to travel into space, and in 1969, the Apollo program culminated in Neil Armstrong's historic moon landing, marking a giant leap for mankind.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-space-race_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-space-race_ar_female.mp3"
    },
    {
      "id": "a-journey-through-the-seven-wonders",
      "title_en": "A Journey Through the Seven Wonders",
      "title_ar": "رحلة عبر عجائب الدنیا السبع",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A journey through the Seven Wonders explores both the ancient marvels and modern lists of world wonders, showcasing humanity's greatest architectural feats.",
      "content_ar": "عجائب الدنیا السبع ھي معالم مدھشة تمثل أعظم الإنجازات المعماریة في التاریخ. تشمل القائمة الأصلیة الھرم الأكبر في الجیزة، وحدائق بابل المعلقة، وتمثال زیوس،\n\nومعبد أرتمیس، وضریح موسولوس، وتمثال رودس، ومنارة الإسكندریة. ھذه الھیاكل كانت رمزًا للعبقریة .",
      "content_en": "The Seven Wonders of the World are incredible landmarks that showcase humanity’s greatest architectural achievements.\n\nThe original list included the Great Pyramid of Giza, the Hanging Gardens of Babylon, the Statue of Zeus, the Temple of Artemis, the Mausoleum at Halicarnassus, the Colossus of Rhodes, and the Lighthouse of Alexandria. These structures were symbols of engineering brilliance and creativity in the ancient world.",
      "audioArMale": "data/audio/nonfiction/nonfiction_a-journey-through-the-seven-wonders_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_a-journey-through-the-seven-wonders_ar_female.mp3"
    },
    {
      "id": "road-trip-across-america",
      "title_en": "Road Trip Across America",
      "title_ar": "رحلة بریة عبر أمریكا",
      "genre": "Non-Fiction",
      "sub_genre": "Travel",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A road trip across America offers an unforgettable adventure through diverse landscapes, iconic highways, and vibrant cultural experiences.",
      "content_ar": "استكشاف الولایات المتحدة عبر رحلة بریة ھو تجربة لا تُنسى، حیث توفر الطرق السریعة مناظر خلابة ومعالم فریدة. یعد طریق 66 من أشھر الطرق في أمریكا،\n\nحیث یمتد من شیكاغو إلى لوس أنجلوس، مرورًا بثماني ولایات،\n\nوھو رمز للحریة والمغامرة في الثقافة الأمریكیة الذي یمتد على طول الساحل الغربی،\n\nمقدمًا Highway)، Coast (Pacific  طریق آخر مذھل ھو طریق المحیط الھادئ السریع مناظر خلابة للمحیط والمنحدرات الساحلیة. ھناك أیضًا طریق بلو ریدج ،باركواي الذي یمر عبر جبال الأبلاش ویوفر مناظر طبیعیة . رائعة،",
      "content_en": "Exploring the United States by road is an unforgettable adventure, with scenic highways and iconic landmarks along the way. One of the most famous routes is Route 66, stretching from Chicago to Los Angeles, passing through eight states.\n\nIt symbolizes freedom and adventure in American culture. Another breathtaking drive is the Pacific Coast Highway, running along the West Coast with stunning ocean views and dramatic cliffs. For those who love nature, Blue Ridge Parkway winds through the Appalachian Mountains, offering spectacular scenery, especially in the fall.",
      "audioArMale": "data/audio/nonfiction/nonfiction_road-trip-across-america_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_road-trip-across-america_ar_female.mp3"
    },
    {
      "id": "deserts-of-the-world",
      "title_en": "Deserts of the World",
      "title_ar": "صحارى العالم",
      "genre": "Non-Fiction",
      "sub_genre": "Travel",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Deserts, with their extreme environments and unique landscapes, play a vital role in global ecosystems, offering insights into both natural beauty and survival.",
      "content_ar": "تعتبر الصحارى من أكثر البیئات تطرفًا على وجھ الأرض، لكنھا رغم قسوتھا، تتمتع بتنوع مذھل في الطبیعة والحیاة. ومن بین أشھر : الصحارى في العالم ● الصحراء :الكبرى تمتد عبر شمال إفریقیا، وھي أكبر صحراء حارة في العالم. تتمیز بالكثبان الرملیة الشاھقة، والواحات النادرة، وتاریخ طویل من القوافل التجاریة التي كانت تعبرھا. رغم مناخھا القاسي، تعیش فیھا مجتمعات مثل الطوارق الذین .\n\nتكیفوا مع بیئتھا الصعبة ● صحراء :أتاكاما تقع في تشیلي، وتُعد من أكثر الأماكن جفافًا على وجھ الأرض. تشتھر بمناظرھا القمریة، وودیانھا الملونة، . وكونھا موقعًا مثالیًا لمراقبة النجوم بسبب قلة التلوث الضوئي ● صحراء :غوبي تمتد عبر منغولیا والصین، وھي صحراء باردة تحتوي على تضاریس متنوعة، من السھول الرملیة إلى الجبال . الصخریة. اشتھرت تاریخیًا كممر رئیسي على طریق الحریر،",
      "content_en": "Deserts are some of the most extreme environments on Earth, yet they hold incredible diversity in landscapes and life. Among the most famous deserts: The Sahara Desert in North Africa is the largest hot desert, known for its towering sand dunes and scarce oases; the Atacama Desert in Chile is one of the driest places on Earth, famed for its lunar landscapes; and the Gobi Desert, spanning parts of Mongolia and China, offers a mix of sandy plains and rugged mountains.",
      "audioArMale": "data/audio/nonfiction/nonfiction_deserts-of-the-world_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_deserts-of-the-world_ar_female.mp3"
    },
    {
      "id": "the-silk-road-rediscovered",
      "title_en": "The Silk Road Rediscovered",
      "title_ar": "طریق الحریر المعاد اكتشافھ",
      "genre": "Non-Fiction",
      "sub_genre": "History",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Silk Road was an ancient network of trade routes connecting Asia, the Middle East, and Europe, fostering cultural exchange and economic prosperity.",
      "content_ar": "كان طریق الحریر أحد أھم الطرق التجاریة في التاریخ، حیث ربط بین آسیا، والشرق الأوسط، وأوروبا، وساھم في تبادل السلع والثقافات . والأفكار عبر القارات امتد الطریق لمسافة تزید عن 6,000 كیلومتر، حیث بدأ من الصین مرورًا بآسیا الوسطى، ثم إلى الشرق الأوسط، وصولاً إلى أوروبا.\n\nكان التجار یحملون الحریر، والتوابل، والخزف، والأحجار الكریمة، مما جعل ھذه التجارة تزدھر. لكن الطریق لم یكن مجرد ممر للبضائع، بل كان أیضًا طریقًا لتبادل المعرفة، حیث انتشرت تقنیات الطباعة والورق والطب من الصین إلى الغرب، بینما انتقلت الفلسفات .",
      "content_en": "The Silk Road was one of history’s most important trade routes, connecting Asia, the Middle East, and Europe while fostering the exchange of goods, cultures, and ideas. Stretching over 6,000 kilometers, the route started in China, passed through Central Asia and the Middle East, and reached Europe.\n\nMerchants traded silk, spices, ceramics, and precious gems, fueling economic prosperity. However, the Silk Road was more than just a trade network—it was a bridge for knowledge, with innovations like printing and papermaking traveling along its paths.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-silk-road-rediscovered_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-silk-road-rediscovered_ar_female.mp3"
    },
    {
      "id": "antarctica-the-last-frontier",
      "title_en": "Antarctica: The Last Frontier",
      "title_ar": "أنتاركتیكا الحدود الأخیرة",
      "genre": "Non-Fiction",
      "sub_genre": "Travel",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Antarctica, the vast frozen continent, is one of the most remote and harsh environments on Earth, offering a unique adventure for explorers.",
      "content_ar": "أنتاركتیكا، القارة البیضاء الشاسعة، ھي واحدة من أكثر الأماكن عزلةً وغموضًا على وجھ الأرض. على رغم من درجات الحرارة . القاسیة التي تصل أحیانًا إلى 80- درجة مئویة، فإن ھذه القارة المتجمدة تعج بالحیاة البریة الفریدة والمناظر الطبیعیة المذھلة یعد الوصول إلى أنتاركتیكا مغامرة بحد ذاتھا،\n\nحیث لا توجد رحلات تجاریة منتظمة، ویتم الوصول إلیھا غالبًا عبر رحلات استكشافیة من أمریكا الجنوبیة. بمجرد الوصول، یكتشف الزوار مشاھد مذھلة من الجبال الجلیدیة الضخمة والأنھار الجلیدیة الممتدة بلا نھایة. من بین أبرز التجارب ھناك مراقبة مستعمرات البطاریق الإمبراطوریة، التي تعیش في بیئة قاسیة وتعتمد على التعاون الاجتماعي للبقاء على قید الحیاة. كما یمكن مشاھدة الحیتان الضخمة التي تھاجر عبر المیاه الباردة،",
      "content_en": "Antarctica, the vast white continent, is one of the most isolated and mysterious places on Earth. Despite extreme temperatures that can drop to -80°C, this frozen land is teeming with unique wildlife and breathtaking landscapes.\n\nReaching Antarctica is an adventure in itself, as there are no regular commercial flights—most visitors arrive via expedition cruises. Once there, they encounter stunning ice formations, massive glaciers, and emperor penguin colonies that thrive in the harsh climate.",
      "audioArMale": "data/audio/nonfiction/nonfiction_antarctica-the-last-frontier_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_antarctica-the-last-frontier_ar_female.mp3"
    },
    {
      "id": "the-trans-siberian-railway-adventure",
      "title_en": "The Trans-Siberian Railway Adventure",
      "title_ar": "مغامرة السكك الحدیدیة العابرة لسیبیریا",
      "genre": "Non-Fiction",
      "sub_genre": "Travel",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Trans-Siberian Railway is the longest railway in the world, offering a unique journey through diverse landscapes across Russia.",
      "content_ar": "رحلة القطار العابر لسیبیریا ھي واحدة من أعظم المغامرات في العالم، حیث تمتد عبر روسیا لمسافة تزید على 9,000 كیلومتر، من . موسكو إلى فلادیفوستوك،\n\nمما یجعلھا أطول خط سكة حدید في العالم یأخذك ھذا القطار في رحلة عبر ثمانیة مناطق زمنیة، مرورًا بمناظر طبیعیة متنوعة تشمل الغابات الشاسعة، والأنھار العظیمة،\n\nوالقرى النائیة،\n\nوحتى بحیرة بایكال، أعمق بحیرة للمیاه العذبة في العالم. المسافرون على متن القطار یختبرون تجربة فریدة، حیث یمكنھم التفاعل مع السكان المحلیین،\n\nوتذوق المأكولات الروسیة التقلیدیة، مثل البورش الفطائرو ،السیبیریة والاستمتاع بجو ھادئ بعیدًا عن صخب .",
      "content_en": "The Trans-Siberian Railway is one of the world’s greatest travel adventures, spanning over 9,000 kilometers across Russia, from Moscow to Vladivostok, making it the longest railway line in the world.\n\nThis journey takes travelers through diverse landscapes, including vast forests, sprawling steppes, and remote villages. Along the way, passengers experience Russian culture firsthand, from traditional cuisine to local customs.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-trans-siberian-railway-adventure_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-trans-siberian-railway-adventure_ar_female.mp3"
    },
    {
      "id": "the-mystery-of-the-black-dahlia",
      "title_en": "The Mystery of the Black Dahlia",
      "title_ar": "لغز الدالیا السوداء",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Black Dahlia case, involving the brutal murder of Elizabeth Short in 1947, remains one of America’s most infamous unsolved crimes.",
      "content_ar": "في عام ،1947 عُثر على جثة إلیزابیث ،شورت المعروفة باسم \"الدالیا ،السوداء\" مقطعة بطریقة مروعة في لوس أنجلوس، في واحدة من أكثر الجرائم غموضًا في التاریخ الأمریكي. كانت إلیزابیث شابة طموحة تحلم بأن تصبح ممثلة، لكن حلمھا انتھى بجریمة وحشیة لم . یتم حلھا حتى الیوم أثارت الجریمة اھتمامًا واسعًا بسبب طبیعة القتل المروعة،\n\nحیث تم العثور على جسدھا مقسمًا إلى نصفین، مع وجود علامات واضحة على التعذیب. تلقت الشرطة العدید من البلاغات والشھادات، لكن لم یتم التوصل إلى القاتل، رغم التحقیقات المكثفة والادعاءات العدیدة .",
      "content_en": "In 1947, the body of Elizabeth Short, known as the 'Black Dahlia,' was discovered brutally mutilated in Los Angeles, making it one of America’s most infamous unsolved murders. Elizabeth Short was a young aspiring actress whose promising career was cut short by a horrific crime that shocked the nation.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-mystery-of-the-black-dahlia_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-mystery-of-the-black-dahlia_ar_female.mp3"
    },
    {
      "id": "the-zodiac-killer",
      "title_en": "The Zodiac Killer",
      "title_ar": "قاتل زودیاك",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Zodiac Killer terrorized Northern California in the late 1960s and early 1970s, leaving behind cryptic messages that have stymied investigators for decades.",
      "content_ar": "في أواخر الستینیات وأوائل السبعینیات، نشر \"قاتل زودیاك\" الرعب في شمال كالیفورنیا، حیث ارتكب سلسلة من جرائم القتل البشعة، . وترك خلفھ ألغازًا ورسائل مشفرة أرسلھا إلى الصحف المحلیة ادّعى القاتل مسؤولیتھ عن قتل خمسة أشخاص على ،الأقل لكنھ ألمح إلى أن العدد قد یكون أكبر بكثیر. كانت رسائلھ ملیئة بالرموز .\n\nالغامضة والتحدیات للشرطة، مما جعلھ أحد أكثر القتلة المتسلسلین غموضًا في التاریخ الأمریكي رغم تحقیقات مكثفة، لم یتم التعرف رسمیًا على ھویة القاتل. على مر العقود، ظھرت عدة نظریات وأسماء مشتبھ بھا، لكن لم یتم تأكید أي منھا بشكل قاطع. لا یزال زودیاك أحد أشھر القتلة الذین أفلتوا من العدالة،",
      "content_en": "During the late 1960s and early 1970s, the Zodiac Killer terrorized Northern California by committing a series of brutal murders and taunting the police with cryptic letter\n\ns and ciphers. Despite numerous investigations and a plethora of suspects, the killer was never caught, and his identity remains one of true crime’s most enduring mysteries.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-zodiac-killer_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-zodiac-killer_ar_female.mp3"
    },
    {
      "id": "the-green-river-killer",
      "title_en": "The Green River Killer",
      "title_ar": "قاتل نھر غرین",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Gary Ridgway, known as the Green River Killer, was a prolific serial killer who murdered dozens of women in Washington state over several years.",
      "content_ar": "كان غاري ،ریدجواي المعروف باسم \"قاتل نھر ،غرین\" واحدًا من أكثر القتلة المتسلسلین دمویة في تاریخ الولایات المتحدة. خلال فترة امتدت من عام 1982 إلى ،1998 قتل ریدجواي العشرات من النساء في ولایة واشنطن، معظمھن من العاملات في مجال الدعارة أو . النساء الھاربات حصل على لقبھ لأن العدید من ضحایاه تم العثور علیھم بالقرب من نھر .غرین كان ریدجواي ذكیًا في تجنب الشرطة، حیث استمر في .\n\nتورطھ في الجرائم (DNA)  جرائمھ لعقود قبل أن یتم القبض علیھ أخیرًا في عام ،2001 عندما كشفت تقنیة تحلیل الحمض النووي في عام ،2003 اعترف بقتل 49 ،امرأة لكن السلطات تشتبھ في أن العدد الحقیقي قد یكون أكثر من 90 .ضحیة لتجنب عقوبة الإعدام، . قدم معلومات عن أماكن دفن بعض ضحایاه ما جعل ریدجواي مرعبًا ھو مدى ھدوئھ وحیاتھ الطبیعیة الظاھرة؛ كان متزوجًا، یعمل في مصنع للشاحنات، ولم یكن أحد یشك فیھ. أدت جرائمھ إلى تسلیط الضوء على أھمیة تطویر تكنولوجیا الأدلة الجنائیة،",
      "content_en": "Gary Ridgway, known as the Green River Killer, was one of America’s most prolific serial killers. Between 1982 and 1998, he murdered dozens of women in Washington state, primarily targeting vulnerable individuals.\n\nHe evaded capture for years until advances in DNA technology finally linked him to multiple crimes in 2001. Ridgway eventually confessed to 49 murders in 2003, though the actual number of victims is suspected to be much higher.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-green-river-killer_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-green-river-killer_ar_female.mp3"
    },
    {
      "id": "the-chicago-tylenol-murders",
      "title_en": "The Chicago Tylenol Murders",
      "title_ar": "جرائم تایلینول في شیكاغو",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Chicago Tylenol Murders involved a series of poisoning deaths in 1982, leading to major changes in product packaging and consumer safety laws.",
      "content_ar": "في عام ،1982 أصیبت أمریكا بالذعر بعد سلسلة من الوفیات الغامضة في ،شیكاغو حیث توفي سبعة أشخاص فجأة بعد تناولھم حبوب . تایلینول العادیة. عند التحقیق، اكتشف المسؤولون أن بعض عبوات الدواء تم تسمیمھا ،بالسیانید وھو سم قاتل یعمل بسرعة أدى ھذا الحدث إلى واحدة من أكبر التحقیقات الجنائیة في تاریخ الولایات المتحدة، لكن لم یتم العثور على الجاني مطلقًا. رغم وجود عدة .\n\nنظریات ومشتبھ بھم، لم یتم توجیھ أي اتھام رسمي كانت عواقب ھذه الجریمة واسعة النطاق، حیث أدت إلى تغییرات كبیرة في قوانین تغلیف .الأدویة بدأت الشركات في استخدام أغطیة . محكمة الإغلاق والعبوات المقاومة للعبث، مما أصبح معیارًا عالمیًا لحمایة المستھلكین من التلاعب بالمنتجات ظلت جرائم تایلینول في شیكاغو واحدة من أعظم الألغاز في تاریخ الجریمة، حیث لم یتم الكشف عن ھویة القاتل ولا الدافع الحقیقي وراء الجریمة. ولكن بفضل ھذا الحادث،",
      "content_en": "In 1982, a series of sudden deaths in Chicago were linked to Tylenol capsules that had been tampered with cyanide.\n\nThe Chicago Tylenol Murders resulted in the deaths of seven people and sparked one of the largest criminal investigations in U.S. history.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-chicago-tylenol-murders_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-chicago-tylenol-murders_ar_female.mp3"
    },
    {
      "id": "the-boston-strangler",
      "title_en": "The Boston Strangler",
      "title_ar": "الخنّاق من بوسطن",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Boston Strangler is one of the most infamous serial killers in American history, whose crimes in the early 1960s led to widespread fear and controversy.",
      "content_ar": "في أوائل الستینیات، عاشت بوسطن حالة من الرعب بسبب سلسلة من جرائم القتل الوحشیة التي استھدفت النساء. بین عامي 1962 ،1964و تم قتل 13 ،امرأة معظمھن تعرضن للخنق داخل منازلھن دون أي علامات على اقتحام. كان القاتل معروفًا بأسلوبھ المثیر . للرعب، حیث لم تكن ھناك أي آثار عنف واضحة،\n\nمما أثار الذعر وجعل النساء یشعرن بعدم الأمان حتى داخل بیوتھن في عام ،1964 ألقت الشرطة القبض على ألبرت دي ،سالفو الذي اعترف بجرائم القتل. كان دي سالفو مجرمًا سابقًا، معروفًا بارتكاب اعتداءات جنسیة، لكنھ لم یُقبض علیھ بسبب القتل حتى اعترف بنفسھ. مع ذلك، لم یكن ھناك دلیل مباشر یربطھ بجمیع الجرائم، مما أثار .",
      "content_en": "In the early 1960s, Boston was gripped by fear as a serial killer, later dubbed the Boston Strangler, targeted women, murdering 13 individuals between 1962 and 1964.\n\nThe crimes involved the strangulation of women in their homes, causing widespread panic.\n\nAlthough Albert DeSalvo confessed to the murders, doubts about his guilt and the possibility of multiple perpetrators have persisted over the decades.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-boston-strangler_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-boston-strangler_ar_female.mp3"
    },
    {
      "id": "the-mafias-rise-and-fall-in-america",
      "title_en": "The Mafia’s Rise and Fall in America",
      "title_ar": "صعود وسقوط المافیا في أمریكا",
      "genre": "Non-Fiction",
      "sub_genre": "True Crime",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The Mafia’s rise in America during Prohibition and its subsequent decline due to federal crackdowns reshaped organized crime in the U.S.",
      "content_ar": "في أوائل القرن العشرین، برزت المافیا الإیطالیة الأمریكیة كأقوى منظمة إجرامیة في الولایات المتحدة، مستفیدة من عصر حظر الكحول . )1920-1933( الذي فتح الباب أمام تجارة الكحول غیر المشروعة، مما جلب لھم ثروات طائلة ونفوذًا سیاسیًا في الأربعینیات والخمسینیات، عززت المافیا سیطرتھا على نیویورك، شیكاغو، ولاس ،فیغاس حیث تورطت في المقامرة غیر المشروعة، الابتزاز،\n\nوجرائم القتل المدبّرة. كانت العائلات الإجرامیة الكبرى، مثل عائلة غامبینو، كولومبو، ،ولوشیزي تدیر . إمبراطوریات تحت قیادة زعماء مثل آل كابوني، فیتو جینوفیز، وكارلو غامبینو بدأت الحرب الحقیقیة ضد المافیا في السبعینیات والثمانینیات، عندما استخدمت الحكومة الفیدرالیة قانون مكافحة الجریمة المنظمة لتوجیھ اتھامات بالفساد وغسیل الأموال ضد الزعماء الرئیسیین. أدى شھادة رجال العصابات ،التائبین مثل سامي \"ذا بول\" (RICO) .",
      "content_en": "In the early 20th century, the Italian-American Mafia emerged as a powerful organized crime syndicate in the United States, capitalizing on the Prohibition Era to build vast criminal empires.\n\nMajor crime families, such as those in New York, Chicago, and Las Vegas, dominated illegal activities like bootlegging, gambling, and extortion.\n\nHowever, federal efforts, particularly the implementation of the RICO Act in the 1970s and 1980s, led to the dismantling of many of these organizations.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-mafias-rise-and-fall-in-america_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-mafias-rise-and-fall-in-america_ar_female.mp3"
    },
    {
      "id": "the-life-of-a-cell",
      "title_en": "The Life of a Cell",
      "title_ar": "حیاة الخلیة",
      "genre": "Non-Fiction",
      "sub_genre": "Science",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Cells are the fundamental units of life, comprising all living organisms and responsible for energy production, growth, and reproduction.",
      "content_ar": "الخلیة ھي الوحدة الأساسیة للحیاة، حیث تشكل جمیع الكائنات الحیة، من أصغر البكتیریا إلى أكبر الأشجار والحیوانات. تتكون الخلایا من أجزاء رئیسیة مثل الغشاء الخلوي الذي یحمیھا، النواةو التي تحتوي على المادة الوراثیة،\n\nالمیتوكندریاو التي تعمل كمحطة طاقة توفر . الطاقة اللازمة للخلیة تأتي الخلایا بأشكال وأحجام مختلفة، وتنقسم إلى نوعین رئیسیین: الخلایا بدائیة ،النواة مثل البكتیریا،\n\nالتي لا تحتوي على نواة حقیقیة، .\n\nالخلایاو حقیقیة ،النواة مثل خلایا الإنسان، التي تمتلك نواة وعضیات متخصصة . بفضل ھذه الخلایا، یمكن للكائنات الحیة النمو، والتكاثر، والبقاء على قید الحیاة،",
      "content_en": "Cells are the building blocks of life, forming all living organisms, from tiny bacteria to giant trees and animals.\n\nEach cell has essential parts, including the cell membrane, which protects it, the nucleus, which stores genetic information, and the mitochondria, which act as the powerhouse, supplying energy. Cells come in many shapes and sizes and fall into two main categories: prokaryotic cells, like bacteria, which lack a true nucleus, and eukaryotic cells, like human cells, which have a nucleus and specialized organelles.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-life-of-a-cell_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-life-of-a-cell_ar_female.mp3"
    },
    {
      "id": "the-water-cycle",
      "title_en": "The Water Cycle",
      "title_ar": "الماء دورة",
      "genre": "Non-Fiction",
      "sub_genre": "Science",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "The water cycle is essential for sustaining life on Earth, continuously moving through evaporation, condensation, and precipitation.",
      "content_ar": "والجداول. الأنهار عبر الأرض إلى أخرى مرة لتعود الثلوج أو الأمطار تسقط وبعدها السحب، مكونًا ويتكثف يبرد ثم الهواء،\n\nفي يرتفع بخار إلى تتحول والبحيرات، المحيطات في المياه الشمس تسخن عندما الحياة. على الحفاظ في أساسيًا دورًا يلعب مما والتساقط،",
      "content_en": "The water cycle is essential for sustaining life on Earth, continuously moving through evaporation, condensation, and precipitation. When the sun heats water in oceans, lakes, and rivers, it turns into water vapor and rises into the air.\n\nThe vapor cools and condenses into clouds. Eventually, the moisture accumulates and falls as rain or snow, flowing through rivers and streams before returning to the oceans, where the cycle begins again.",
      "audioArMale": "data/audio/nonfiction/nonfiction_the-water-cycle_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_the-water-cycle_ar_female.mp3"
    },
    {
      "id": "earths-greatest-extinctions",
      "title_en": "Earth’s Greatest Extinctions",
      "title_ar": "الأرض على الانقراضات أعظم",
      "genre": "Non-Fiction",
      "sub_genre": "Science",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "Earth has experienced several major mass extinctions throughout its history, events that dramatically reshaped the evolution of life on our planet.",
      "content_ar": "المعاصرة. البيئية التهديدات فهم في الانقراضات هذه دراسة تساهم للنمو. فرصة الثدييات ومنح الطائرة غير الديناصورات اختفاء إلى أدى نيزكي تأثير عن الناتج مضت) سنة مليون (66 الطباشيري-الباليوجيني العصر انقراض وختمته الديناصورات، لهيمنة الطريق تمهيد إلى مضت) سنة مليون (200 الترياسي-اليوراسي انقراض أدى ذلك،\n\nبعد سيبيريا. في الهائل البركاني للثوران نتيجة ربما البرية،\n\nالكائنات من و70% البحرية الكائنات من 96% فُقد حيث العظيم\"، بـ\"الموت المعروف مضت)،\n\nسنة مليون (252 البرمي-ترياسي انقراض تلاه الأنواع. من 75% بحياة أودى الذي مضت) سنة مليون (375 المتأخر الديفوني انقراض جاء ثم مفاجئ. جليدي عصر بسبب البحرية الكائنات من 85% على قضى الذي مضت) سنة مليون (443 الأوردوفيشي-سيلوري انقراض أولاً، كارثية.",
      "content_en": "Earth has experienced five major mass extinctions, where large portions of life disappeared due to environmental shifts or catastrophic events. The Ordovician-Silurian Extinction (443 million years ago) wiped out 85% of marine species, likely caused by a sudden ice age that led to falling sea levels and drastic climate changes.\n\nThe Late Devonian Extinction (375 million years ago) eliminated 75% of species, potentially due to climate shifts or declining ocean oxygen levels. The Permian-Triassic Extinction (252 million years ago), known as the 'Great Dying,' killed 96% of marine species and 70% of land vertebrates, possibly due to massive volcanic eruptions in Siberia. The Triassic-Jurassic Extinction (200 million years ago) wiped out 80% of species, paving the way for dinosaur dominance, and the Cretaceous-Paleogene Extinction (66 million years ago) is famous for the asteroid impact that led to the disappearance of non-avian dinosaurs, allowing mammals to rise.",
      "audioArMale": "data/audio/nonfiction/nonfiction_earths-greatest-extinctions_ar_male.mp3",
      "audioArFemale": "data/audio/nonfiction/nonfiction_earths-greatest-extinctions_ar_female.mp3"
    }
  ]
}