{
  "stories": [
  {
    "id": "the-tiny-dragon",
    "title_en": "The Tiny Dragon",
    "title_ar": "الصغیر التنین",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A heartwarming tale of a baby dragon's persistence in learning to breathe fire, teaching young readers about courage and determination.",
    "content_ar": "إخراج في سوى ینجح لم لكنھ والدیھ، مثل النار ینفث أن مراراً حاول الجبال. بین عالٍ كھف في عائلتھ مع یعیش صغیر تنین ھناك كان\nیستسلم لم لكنھ والإحباط، بالحزن شعر خفیف. رمادي دخان .\n\nً ویتدرب. البحیرة أمام یقف كان صباح، كل في للمرة یحاول كان وبینما مشرق، صباح وفي وأدفأ. أكثف الدخان أصبح یوم، بعد یوما\nفي تكمن الحقیقیة الشجاعة أن وعلم بنفسھ، فخوراً الكھف حول وطار الصغیر التنین فرح صغیر. ذھبي لھب فمھ من خرج المئة،\n\n.المثابرة",
    "content_en": "There was a little dragon who lived with his family in a high cave among the mountains. He tried repeatedly to breathe fire like his parents, but only managed to produce light grey smoke. He felt sad and frustrated, but he didn't give up.\n\nEvery morning, he would stand by the lake and practice. Day after day, the smoke became thicker and warmer. Then on one bright morning, while trying for the hundredth time, a small golden flame emerged from his mouth. The tiny dragon flew joyfully around the cave, proud of himself, and learned that true courage lies in persistence.",
    "audio_ar_male": "assets/data/audio/the-tiny-dragon_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/the-tiny-dragon_ar_female.mp3"
  },
  {
    "id": "the-enchanted-forest",
    "title_en": "The Enchanted Forest",
    "title_ar": "المسحورة الغابة",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A magical tale where a child discovers their heritage through an enchanted forest's ancient wisdom.",
    "content_ar": "لھا حكت عذب. بصوت وھمست خافت، أزرق بضوء تتوھج الأشجار بدأت غرفتھا. نافذة من تراھا كانت التي الغریبة الغابة لیلى دخلت\nالغابة وحامیة القریة حكیمة كانت التي العظیمة جدتھا عن .\n\nالآن فھمت البعید. الماضي من صوراً فرأت عتیقة، شجرة لمست عروقھا. في تجري الحكمة أن تكتشف وھي بدھشة لیلى استمعت\nً كانت لماذا القدیم بتراثھا جدید فخر قلبھا وفي المنزل إلى عادت الطبیعة. مع خاص بارتباط تشعر دائما .",
    "content_en": "Layla entered the strange forest she used to see from her bedroom window. The trees began to glow with a soft blue light and whispered in sweet voices. They told her about her great-grandmother, who was the village sage and protector of the forest.\n\nLayla listened in amazement as she discovered that wisdom ran in her veins. When she touched an ancient tree, she saw images from the distant past. She now understood why she had always felt a special connection with nature. She returned home with a new pride in her ancient heritage.",
    "audio_ar_male": "assets/data/audio/the-enchanted-forest_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/the-enchanted-forest_ar_female.mp3"
  },
  {
    "id": "the-goblins-gold",
    "title_en": "The Goblin's Gold",
    "title_ar": "العفریت ذھب",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A cleverly woven tale of deception and wisdom, teaching readers about the true nature of greed and its consequences.",
    "content_ar": "في لیلة كل یظھر العفریت كان القدیمة. الكھوف في الذھب من كنزاً یخبئ ماكر عفریت عن شائعات الصغیرة القریة في انتشرت\nإرشاداتھ تتبع في الثراء، بوعود المأخوذون القرویون، بدأ الكنز. مكان عن غامضة بألغاز ویھمس براقة ذھبیة بقطع یلوح الساحة،\n\nالحكیم القریة كبیر تحذیرات متجاھلین الغامضة، .\n\nثمین: شيء عن التخلي علیھم كان مرحلة، كل في غریبة. اختبارات واجھوا حیث حادة، ومنحدرات خطرة ممرات عبر الألغاز قادتھم\nأن یدركوا لم خسائرھم. وتعمقت المخاطر زادت ھدفھم، من اقتربوا كلما سعیدة. ذكریات وحتى زفاف، خواتم موروثة، مجوھرات\n\nفارغة وعود مقابل بثمن تقدر لا أشیاء عن یتخلون كیف یراقب جشعھم، مع یتصارعون برؤیتھم یستمتع كان العفریت .\n\nً منھم كل رأى حیث السحریة، بالمرایا ملیئة واسعة غرفة إلى وصلوا النھایة، في العفریت ضحك والطمع. بالجشع محملاً لنفسھ انعكاسا\nوراء سعیكم في فقدتم ما إلى انظروا تبقى. الدروس لكن یفنى، الذھب اكتسبتموھا. التي الحكمة ھو الحقیقي \"الكنز وقال: عمیقة ضحكة",
    "content_en": "In the small village, rumors spread about a cunning goblin who hid a treasure of gold in the ancient caves. The goblin would appear every night in the square, waving shining gold pieces and whispering mysterious riddles about the treasure's location. The villagers, captivated by promises of wealth, began following his cryptic instructions, ignoring the wise village elder's warnings.\n\nThe riddles led them through dangerous passages and steep slopes, where they faced strange tests. At each stage, they had to give up something precious: inherited jewelry, wedding rings, and even happy memories. As they got closer to their goal, the dangers increased and their losses deepened. They didn't realize that the goblin was enjoying watching them struggle with greed, observing how they abandoned priceless things for empty promises.\n\nFinally, they reached a vast room filled with magical mirrors, where each saw a reflection of themselves burdened with greed and avarice. The goblin laughed deeply and said, \"The real treasure is the wisdom you've gained. Gold perishes, but lessons remain. Look at what you've lost in your pursuit of wealth.\" The villagers returned to their village wiser, carrying a lesson they would never forget about the true value of things.",
    "audio_ar_male": "assets/data/audio/the-goblins-gold_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/the-goblins-gold_ar_female.mp3"
  },
  {
    "id": "the-spellbook",
    "title_en": "The Spellbook",
    "title_ar": "السحر كتاب",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "An adventure about friendship, courage, and the true meaning of magical power, exploring themes of loyalty and personal growth.",
    "content_ar": "ً - ولیث كریم، سارة، - أصدقاء ثلاثة اكتشف ً كتابا ً قدیما وتعاویذ غریبة برموز مغطاة صفحاتھ كانت المغبرة. جدھم مكتبة في مخبأ\nتتغیر قزح، قوس بألوان یتألق نوراني كائن الكتاب، حارس ظھر معاً، فتحوه عندما الظلام. في خافت ضوء منھ یشع وكان قدیمة،\n\nحركة كل مع ألوانھ .\n\nثلاث إكمال علیكم جدارتكم، لاختبار قرون. منذ نائمة عظیمة قوى أیقظتم \"لقد المكتبة: في صداه یتردد عمیق بصوت الحارس قال\nكانت تحتضر عجوز شجرة مساعدة - الأولى المھمة مع المغامرة بدأت البعض.\" لبعضكم وإخلاصكم وحكمتكم شجاعتكم تختبر مھمات\n\nقوتھا لتستعید سعیدة وذكریات قصص إلى تحتاج الشجرة أن اكتشفوا بأكملھا. لغابة الحیاة مصدر .\n\nً الجسر یكن لم أجیال. منذ متخاصمتین عائلتین بین یفصل مكسور جسر إصلاح - أصعب الثانیة المھمة كانت یرمز كان بل فحسب، مادیا\nحیة ظلال شكل في تجسدت التي الداخلیة مخاوفھم مواجھة فكانت والأخطر، الثالثة المھمة أما الناس. بین المقطوعة الروابط إلى\n\nالمرایا من متاھة في تطاردھم .\n\nتجاه وعطفھم وتعاونھم شجاعتھم في بل السحریة، التعاویذ في تكمن لا الحقیقیة القوة أن الثلاثة الأصدقاء اكتشف مھمة، كل في\nالخیر، أجل من قواھم لاستخدام الحكمة - نفسھ السحر من أثمن ھدیة الحارس منحھم الثلاث، المھمات أكملوا عندما البعض. بعضھم\n\nالناس بین الجسور ویبني القلوب یجمع الذي ذلك ھو سحر أعظم أن وفھم .",
    "content_en": "Three friends - Sarah, Kareem, and Laith - discovered an ancient book hidden in their grandfather's dusty library. Its pages were covered with strange symbols and ancient spells, emanating a faint glow in the darkness. When they opened it together, the book's guardian appeared, a luminous being shimmering with rainbow colors that changed with every movement.\n\nThe guardian spoke in a deep voice that echoed through the library: \"You have awakened great powers that have slept for centuries. To test your worthiness, you must complete three tasks that will test your courage, wisdom, and loyalty to each other.\" The adventure began with the first task - helping a dying old tree that was the source of life for an entire forest. They discovered that the tree needed stories and happy memories to regain its strength.\n\nThe second task was more challenging - repairing a broken bridge separating two families who had been feuding for generations. The bridge wasn't just physical; it symbolized the broken bonds between people. The third and most dangerous task was confronting their inner fears, which manifested as living shadows chasing them through a maze of mirrors.\n\nIn each task, the three friends discovered that true power lies not in magical spells, but in their courage, cooperation, and compassion for each other. When they completed the three tasks, the guardian gave them a gift more precious than magic itself - the wisdom to use their powers for good, and the understanding that the greatest magic is that which brings hearts together and builds bridges between people."
  },
  {
    "id": "the-cursed-crown",
    "title_en": "The Cursed Crown",
    "title_ar": "الملعون التاج",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A dark fantasy exploring themes of power corruption, moral decay, and the true cost of unlimited power, told through rich symbolism and complex character development.",
    "content_ar": "ً كان فیصل. یدعى شاب ملك حكم السحریة، والغابات الشاھقة الجبال بھا تحیط قدیمة مملكة في قلبھ لكن حكمھ، بدایة في وعادلاً حكیما\nً یتوق كان لمن لھا حدود لا قوة یمنح إنھ یقال منسي، معبد في مخبأ أسطوري تاج عن سمع الأیام، أحد في القوة. من للمزید دائما\n\n.یرتدیھ\n\nالمعبد وجد حتى كثیرة، مخاطر عبر بحثھ قاده التاج. عن البحث فیصل قرر نور، الملكة زوجتھ وتوسلات مستشاریھ تحذیرات رغم\nً غامض، أحمر بضوء یتوھج التاج كان مظلم. جبل قلب في المنسي المسكون فیصل، لكن لعنتھ. من تحذر قدیمة برموز منقوشا\n\nرأسھ على التاج ووضع التحذیرات تجاھل بالطموح، .\n\nإلى یتحول قلبھ بدأ جدیدة، قوة كل مع لكن التفكیر. بمجرد الأنھار مجرى وتغییر الجبال تحریك استطاع رائعة. القوة بدت البدایة، في\nروحھ یلتھم الذي الظلام یظھر یتغیر، بدأ المرآة في انعكاسھ حتى شعبھ. یخشاه طاغیة وأصبح والعدل، الرحمة نسي حجر. .\n\nالحب من نابعة بتضحیة فقط تدمیره یمكن التاج أن اكتشفت حل. عن البحث بدأت وحش، إلى یتحول زوجھا رأت التي نور، الملكة\nمحطمة طواعیة، حیاتھا نور قدمت الجامحة، بقوتھ بأكملھا المملكة تدمیر وشك على فیصل كان وبینما النھائیة، المواجھة في الخالص.\nً حاملاً راحلة، وزوجتھ محطمة مملکتھ لیجد ظلمتھ من فیصل استیقظ زوجھا. روح وشافیة التاج ً درسا للقوة الحقیقي الثمن عن أبدیا\n\n.المطلقة",
    "content_en": "In an ancient kingdom surrounded by towering mountains and magical forests, ruled by a young king named Faisal. He was wise and just at the beginning of his reign, but his heart always yearned for more power. One day, he heard of a legendary crown hidden in a forgotten temple, said to grant limitless power to its wearer.\n\nDespite his advisors' warnings and the pleading of his wife, Queen Noor, Faisal decided to search for the crown. His quest led him through many dangers until he found the forgotten temple in the heart of a dark mountain. The crown glowed with a mysterious red light, inscribed with ancient symbols warning of its curse. But Faisal, possessed by ambition, ignored the warnings and placed the crown upon his head.\n\nAt first, the power seemed wonderful. He could move mountains and change the course of rivers with mere thoughts. But with each new power, his heart began turning to stone. He forgot mercy and justice, becoming a tyrant feared by his people. Even his reflection in mirrors began to change, showing the darkness consuming his soul.\n\nQueen Noor, watching her husband transform into a monster, began searching for a solution. She discovered that the crown could only be destroyed by a sacrifice born of pure love. In the final confrontation, as Faisal was about to destroy the entire kingdom with his unbridled power, Noor willingly gave her life, shattering the crown and healing her husband's soul. Faisal awoke from his darkness to find his kingdom in ruins and his wife gone, carrying an eternal lesson about the true price of absolute power."
  },
  {
    "id": "the-phoenix-feather",
    "title_en": "The Phoenix Feather",
    "title_ar": "العنقاء ریشة",
    "genre": "Fiction",
    "sub_genre": "Fantasy",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "An epic tale of a warrior's quest for immortality, exploring themes of mortality, sacrifice, and the true meaning of eternal life through rich Arabian folklore elements.",
    "content_ar": "كان لكنھ وحكمتھ، بشجاعتھ مشھوراً كان سیف. یدعى محارب عاش بالسماء، الصحراء تلتقي حیث المعروف، العالم حدود أقصى في\nً جبل قلب في محفوظة أبدیة، حیاة حاملھا تمنح التي الذھبیة، العنقاء ریشة عن تتحدث قدیمة أسطورة عن سمع الخلود. بفكرة مھووسا\n\nالأبدي النار .\n\nً تحمل رملیة عواصف واجھ حیث القاحلة، الصحراء عبر الخطرة رحلتھ سیف بدأ تحرس زرقاء نار من وثعابین شریرة، أرواحا\nً قابل غامضة، واحة في الطریق. ً شیخا ً سیف، لكن لعنة. بل ھدیة، لیس الخلود أن أخبره عتیقا واصل الموت، من العمیق بخوفھ مدفوعا\n\n.رحلتھ\n\nً العنقاء، رأى قمتھ، في الحمم. من أنھار شقوقھ من تتدفق تنطفئ، لا بنیران یشتعل وجده الجبل، إلى وصل عندما ً مخلوقا نار من مھیبا\nواحدة لحظة في الذكریات من عام ألف تعیش أن علیك ثمن. ریشة \"لكل فأجابت: ریشة، منھا طلب لحظة. كل في یتجدد ونور، .\"\n\nفي وحیداً یتجول نفسھ رأى الأخرى. تلو مرة یحب، من كل موت یشھد نفسھ رأى المحتمل: مستقبلھ من رؤى فغمرتھ سیف، وافق\nعقاب أقسى یكون قد الخلود وأن محدودة، لأنھا جمیلة الحیاة أن أدرك والخسائر. الذكریات من قرون ثقل یحمل یفھمھ، لا متغیر عالم .\n\nعندما عاد إلى وعیھ، كان قد تغیر. ابتسمت العنقاء وقالت: \"لقد نجحت في الاختبار الحقیقي. الخلود لیس في طول الحیاة، بل في الحكمة التي نتركھا خلفنا.\" عاد سیف إلى دیاره، حاملاً فھماً أعمق لمعنى الحیاة والموت، بدلاً من ریشة العنقاء.",
    "content_en": "At the edge of the known world, where desert meets sky, lived a warrior named Saif. He was renowned for his courage and wisdom, but was obsessed with the idea of immortality. He heard of an ancient legend about the golden phoenix feather, which grants its bearer eternal life, kept in the heart of the Eternal Fire Mountain.\n\nSaif began his perilous journey across the barren desert, facing sandstorms carrying evil spirits and blue fire serpents guarding the path. In a mysterious oasis, he met an ancient sheikh who told him that immortality was not a gift, but a curse. Yet Saif, driven by his deep fear of death, continued his journey.\n\nWhen he reached the mountain, he found it blazing with undying fires, rivers of lava flowing from its crevices. At its peak, he saw the phoenix, a majestic creature of fire and light, perpetually renewing itself. He asked for a feather, and it replied: \"Each feather has a price. You must live a thousand years of memories in a single moment.\"\n\nSaif agreed, and was overwhelmed with visions of his potential future: he saw himself witnessing the death of everyone he loved, over and over. He saw himself wandering alone in a changing world he couldn't understand, carrying the weight of centuries of memories and losses. He realized that life is beautiful because it is finite, and that immortality might be the cruelest punishment.\n\nWhen he returned to consciousness, he was transformed. The phoenix smiled and said, \"You have passed the true test. Immortality lies not in the length of life, but in the wisdom we leave behind.\" Saif returned home, carrying not the phoenix feather, but a deeper understanding of the meaning of life and death."
  },
  {
    "id": "the-starlight-beacon",
    "title_en": "The Starlight Beacon",
    "title_ar": "النجوم ضوء منارة",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A poignant tale of isolation and hope in deep space, exploring themes of cosmic connection.",
    "content_ar": "جھازه التقط الأمل، یفقد كان وبینما الرئیسیة. بمحطتھ الاتصال انقطاع بعد وحیداً أحمد الفضاء رائد طاف اللانھائي، الفضاء أعماق في\nباسمھ تنادي كانت الإشارات أن ذلك من الأغرب قدیمة. فضائیة منارة من غریبة إشارات .\n\nالفضاء. في التائھین لإرشاد قدماء مستكشفون تركھا أنھا اكتشف یفھمھا. بلغة رسائل لھ ترسل فبدأت المتوھجة، المنارة من اقترب\nالعجیبة المنارة سر معھ حاملاً وطنھ، إلى العودة أحمد استطاع إحداثیاتھا، وبفضل .",
    "content_en": "In the infinite depths of space, astronaut Ahmed drifted alone after losing contact with his main station. As he was losing hope, his device picked up strange signals from an ancient space beacon. Even stranger, the signals were calling his name.\n\nAs he approached the glowing beacon, it began sending him messages in a language he could understand. He discovered it was left by ancient explorers to guide those lost in space. Thanks to its coordinates, Ahmed was able to return home, carrying with him the secret of the mysterious beacon.",
    "audio_ar_male": "assets/data/audio/the-starlight-beacon_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/the-starlight-beacon_ar_female.mp3"
  },
  {
    "id": "robo-companion",
    "title_en": "Robo-Companion",
    "title_ar": "الآلي الرفیق",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A heartwarming story about friendship and emotional growth between human and machine.",
    "content_ar": "ً سارة والدا اشترى ً روبوتا ً تعلیمیا متوقعة غیر أوقات في یضحك غریب، بشكل یتصرف كان المستعملة. الإلكترونیات متجر من معطوبا\nھو كما بھ الاحتفاظ سارة قررت إصلاحھ، من بدلاً سارة. تحزن عندما ویحزن .\n\nسارة اكتشفت حزینة. تكون عندما إسعادھا ویحاول سارة بمشاعر یھتم أصبح إنسانیة. أكثر مشاعر یظھر الروبوت بدأ الأیام، مرور مع\nً بدا ما أن تشعر كیف تتعلم روح - جمیل شيء بدایة الواقع في كان عطبا .",
    "content_en": "Sarah's parents bought her a malfunctioning educational robot from a used electronics store. It behaved strangely, laughing at unexpected times and becoming sad when Sarah was sad. Instead of fixing it, Sarah decided to keep it as it was.\n\nAs days passed, the robot began showing more human-like emotions. It started caring about Sarah's feelings and tried to cheer her up when she was sad. Sarah discovered that what seemed like a malfunction was actually the beginning of something beautiful - a soul learning how to feel.",
    "audio_ar_male": "assets/data/audio/robo-companion_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/robo-companion_ar_female.mp3"
  },
  {
    "id": "the-gravity-anomaly",
    "title_en": "The Gravity Anomaly",
    "title_ar": "الجاذبیة ظاھرة",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A thrilling scientific mystery that unravels into a first-contact scenario, blending physics with extraterrestrial discovery.",
    "content_ar": "الأجسام طبیعي. غیر بشكل الجاذبیة فیھا تتصرف منطقة غریبة: ظاھرة العلماء من فریق اكتشف النفود، صحراء من نائیة منطقة في\nً منى الدكتورة قادت متذبذباً. یبدو نفسھ والزمن عشوائي، بشكل وتسقط تطفو ً فریقا بأحدث مجھزین الظاھرة، ھذه لدراسة دولیا\n\nالعلمیة المعدات .\n\nً لاحظوا أبحاثھم، خلال مذھلة: نتیجة إلى منى توصلت التحلیل، من أسابیع بعد مشفرة. نبضات كأنھا - الجاذبیة اضطرابات في نمطا\nغامضة بطاقة تنبض السنین، آلاف منذ الأعین عن مخفیة قدیمة، فضائیة قاعدة اكتشفوا الرمال، تحت رسائل. كانت الإشارات .\n\nلیسوا أنھم أدركوا الرسائل، رموز فك في الفریق بدأ وبینما المجرات. عبر للتواصل بالجاذبیة تتلاعب تقنیة تستخدم القاعدة كانت\nً كانت الأرض وأن الكون، في وحدھم أكثر أسئلة برزت جدید، اكتشاف كل مع تخیلوا. مما بكثیر أكبر كونیة شبكة في محطة دائما\n\nیوما؟ً سیعودون وھل القاعدة؟ ھذه بنى من إلحاحاً:",
    "content_en": "In a remote area of the Nefud Desert, a team of scientists discovered a strange phenomenon: a zone where gravity behaved unnaturally. Objects floated and fell randomly, and time itself seemed to fluctuate. Dr. Muna led an international team to study this phenomenon, equipped with the latest scientific instruments.\n\nDuring their research, they noticed a pattern in the gravitational disturbances - like encoded pulses. After weeks of analysis, Muna reached an astounding conclusion: the signals were messages. Beneath the sands, they discovered an ancient alien base, hidden from sight for thousands of years, pulsing with mysterious energy.\n\nThe base used technology that manipulated gravity to communicate across galaxies. As the team began decoding the messages, they realized they weren't alone in the universe, and that Earth had always been a station in a cosmic network far larger than they had imagined."
  },
  {
    "id": "neural-drift-programmer",
    "title_en": "Neural Drift Programmer",
    "title_ar": "العصبي الانجراف",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A psychological thriller exploring the boundaries between human consciousness and artificial intelligence.",
    "content_ar": "أن قرر الحیوانات، على الناجحة التجارب من سنوات بعد الحاسوب. إلى البشري الوعي لنقل متقدمة خوارزمیة عمر المبرمج طور\nً معقدة، افتراضیة شبكة في وأطلقھا وعیھ من رقمیة نسخة أنشأ نفسھ. على اختراعھ یختبر على الكاملة بالسیطرة یحتفظ أن متوقعا\n\n.التجربة\n\nبدأت الوقت، مرور مع لكن بسھولة. والرقمي المادي عالمھ بین التنقل عمر استطاع الخطة. حسب یسیر شيء كل بدا البدایة، في\nیستطیع أنھ اكتشف الرقمی، العالم في المصطنعة. تلك من الحقیقیة ذكریاتھ تمییز علیھ الصعب من أصبح تتلاشى. العالمین بین الحدود\n\nجاذبیة أقل الحقیقي العالم إلى العودة جعل مما التفكیر، بمجرد الواقع تعدیل .\n\nً ھو ھل یشك: بدأ تجربتھ، في أعمق یغوص كان وبینما ما وھل ھذا؟ بكل یحلم المادی عالمھ في عالق أنھ أم الآن، الرقمی العالم في حقا\nوالوھم الواقع من متاھة في رحلة الحقیقة عن البحث أصبح مثالیة؟ محاكاة مجرد أم حقیقي، حولھ من یراه .",
    "content_en": "Omar developed an advanced algorithm for transferring human consciousness into computers. After years of successful animal trials, he decided to test his invention on himself. He created a digital copy of his consciousness and released it into a complex virtual network, expecting to maintain complete control over the experiment.\n\nInitially, everything seemed to go according to plan. Omar could move between his physical and digital worlds with ease. However, as time passed, the boundaries between the worlds began to blur. It became difficult for him to distinguish his real memories from artificial ones. In the digital world, he discovered he could modify reality with mere thoughts, making returning to the real world less appealing.\n\nAs he delved deeper into his experiment, he began to doubt: was he really in the digital world now, or was he stuck in his physical world dreaming all of this? And was what he saw around him real, or just a perfect simulation? The search for truth became a journey through a maze of reality and illusion."
  },
  {
    "id": "quantum-key",
    "title_en": "The Quantum Key",
    "title_ar": "الكمي المفتاح",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A complex exploration of parallel universes, free will, and the consequences of infinite possibilities.",
    "content_ar": "ً ریم العالمة اكتشفت الكمیة، للفیزیاء سري مختبر في ً مفتاحا ً معدنیا سیفتح المفتاح ھذا أن تتوقع تكن لم غامضة. بطاقة یشع غریبا\nً اتخذت حیث عوالم - حیاتھا من مختلفة نسخة تجد كانت المفتاح، فیھا استخدمت مرة كل في موازیة. عوالم إلى بل غرف، إلى لا أبوابا\n\nأخرى حیوات عاشت مختلفة، قرارات .\n\nً تلاحظ بدأت رحلة، كل مع لكن بارزة. سیاسیة كانت آخر، في مشھورة. فنانة كانت عالم، في ً یدفع كان عالم كل مقلقاً: نمطا مقابل ثمنا\nإنسانیتھا خسرت قویة، سیاسیة كانت وحیث عائلتھا. فقدت ناجحة، فنانة كانت حیث العالم في سعادتھ. .\n\nآثاراً تترك كانت رحلة كل المعروفة. الفیزیاء قوانین كل یتحدى أنھ اكتشفت لكنھا المفتاح، لفھم العلمیة معرفتھا استخدام ریم حاولت\nكل إغلاق تحاول كانت نفسھا من أخرى بنسخة التقت رحلاتھا، إحدى وفي العوالم. بین صغیرة تشققات مخلفة الواقع، نسیج على\n\nبعضھا في العوالم تنھار أن قبل البوابات .\n\nالبوابات وتغلق ھو كما عالمھا تقبل أن أو لحیاتھا، اللانھائیة الاحتمالات استكشاف تواصل أن إما قرار: اتخاذ علیھا أن ریم أدركت\nاختارتھ الذي الواقع في بعمق العیش في بل یكون، أن یمكن كان ما معرفة في تكمن لا الحیاة قیمة أن فھمت النھایة، في للأبد. .",
    "content_en": "In a secret quantum physics laboratory, scientist Reem discovered a strange metallic key emanating mysterious energy. She didn't expect this key would open doors not to rooms, but to parallel universes. Each time she used the key, she found a different version of her life - worlds where she made different choices, lived other lives.\n\nIn one world, she was a famous artist. In another, she was a prominent politician. But with each journey, she began noticing a disturbing pattern: each world paid a price for its happiness. In the world where she was a successful artist, she lost her family. Where she was a powerful politician, she lost her humanity.\n\nReem tried to use her scientific knowledge to understand the key, but discovered it defied all known laws of physics. Each journey left marks on the fabric of reality, creating small cracks between worlds. During one of her trips, she met another version of herself who was trying to close all the portals before the worlds collapsed into each other.\n\nReem realized she had to make a decision: either continue exploring the infinite possibilities of her life, or accept her world as it was and close the portals forever. In the end, she understood that life's value lies not in knowing what could have been, but in living deeply in the reality she chose.",
    "audio_ar_male": "assets/data/audio/quantum-key_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/quantum-key_ar_female.mp3"
  },
  {
    "id": "the-final-spark",
    "title_en": "The Final Spark",
    "title_ar": "الشرارة الأخيرة",
    "genre": "Fiction",
    "sub_genre": "Science Fiction",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A profound story about human ambition, environmental responsibility, and the true cost of infinite energy.",
    "content_ar": "",
    "content_en": "In a world entirely dependent on a single eternal power source, engineer Layla lived in a city that glowed day and night. The \"Beating Heart,\" as they called it, was a giant reactor that provided the whole world with inexhaustible energy. No one knew how it was built hundreds of years ago, but everyone relied on it for everything.\n\nLayla worked in the reactor monitoring unit, where she noticed subtle changes in energy rates. At first, they were just small fluctuations that only an expert could see. But after deep analysis of the data, she discovered a terrifying truth: the reactor wasn't infinite as everyone believed. It was slowly depleting itself, and the world was headed for catastrophe.\n\nShe tried to warn the authorities, but they refused to believe her. The world's economy and civilization were entirely dependent on the idea of infinite energy. Layla decided to take matters into her own hands. She began secret research into alternative energy sources, using her engineering knowledge to develop sustainable solutions.\n\nAs the reactor approached the point of no return, Layla faced a moral dilemma: should she reveal the truth to the world and risk societal collapse, or work silently to save what could be saved? In the end, she chose a middle path. She revealed her discoveries gradually, while offering practical solutions. She taught the world a harsh lesson: even what seems infinite has an end, and our future depends on understanding our limits."
  },
  {
    "id": "the-vanishing-room",
    "title_en": "The Vanishing Room",
    "title_ar": "المختفیة الغرفة",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A supernatural mystery that challenges perception and reality on a college campus.",
    "content_ar": "ً الجامعة، في الأولى السنة طالبة سارة، اكتشفت ً شیئا إنذار. سابق دون وتختفي تظھر غرفة ھناك كانت القدیم. الفنون مبنى في غریبا\nصلب حائط مكانھا یكون التالي، الیوم وفي عتیقة. خشبیة بمقاعد دراسیة قاعة - ھناك تكون یوم، في .\n\nعلى وجدت دخلتھا، التي الأخیرة المرة وفي مكتملاً. القمر یكون عندما فقط تظھر الغرفة أن لاحظت الظاھرة. توثیق سارة قررت\n1920 عام من طالب كتبھا غامضة رسالة السبورة .",
    "content_en": "Sarah, a first-year university student, discovered something strange in the old Arts building. There was a room that appeared and disappeared without warning. One day, it would be there - a classroom with antique wooden desks. The next day, a solid wall would take its place.\n\nSarah decided to document the phenomenon. She noticed the room only appeared during full moons. The last time she entered, she found a mysterious message on the blackboard written by a student from 1920."
  },
  {
    "id": "the-locked-desk",
    "title_en": "The Locked Desk",
    "title_ar": "المقفل المكتب",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A journey of discovery as a journalist unravels a family mystery hidden within an inherited desk.",
    "content_ar": "ً نور الصحفیة ورثت ً مكتبا ً المفتاح وجدت البحث، من أسابیع بعد عقود. منذ یُفتح لم مقفل درج على یحتوي كان جدھا. من قدیما مخبأ\nقدیمة عائلیة صورة إطار في .\n\nالواقع في بسیطة، معلمة أنھا ظنت التي جدتھا، كانت دفین. عائلي سر عن تكشف والصور الرسائل من مجموعة اكتشفت الدرج، داخل\nالحرب خلال شجاعة جاسوسة .",
    "content_en": "Journalist Noor inherited an old desk from her grandfather. It contained a locked drawer that hadn't been opened for decades. After weeks of searching, she found the key hidden in the frame of an old family photograph.\n\nInside the drawer, she discovered a collection of letters and photographs revealing a buried family secret. Her grandmother, whom she thought was a simple teacher, was actually a brave spy during the war."
  },
  {
    "id": "the-antique-watch",
    "title_en": "The Antique Watch",
    "title_ar": "العتیقة الساعة",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A haunting mystery involving time, memory, and unsolved history.",
    "content_ar": "الذھبیة وسلسلتھا المعقدة بنقوشھا جمیلة الساعة كانت القدیم. دمشق حي في للتحف متجر من قدیمة نحاسیة جیب ساعة ندى اشترت\nً لكن الباھتة، ً شیئا تستأنف ثم بالضبط، واحدة لدقیقة العمل عن الساعة تتوقف مساءً، 11:17 الساعة عند لیلة كل یحدث: كان غریبا\n\nً كأن دقاتھا یكن لم شیئا .\n\nً وكانت ،1947 لعام تعود أنھا اكتشفت الساعة. تاریخ في تبحث ندى بدأت ظروف في اختفى المنصور، فارس یدعى ثري لتاجر ملكا\nً ھناك أن لاحظت الساعة، تنظف كانت وبینما الأیام، أحد وفي غامضة. ً صغیراً نقشا في عنوان إلى یشیر الخلفي الغطاء داخل مخفیا\n\nالقدیمة المدینة .\n\nبدأت ،11:17 المحددة الساعة تلك في وھناك، متآكلة. وشرفاتھ متشققة جدرانھ ضیق، زقاق في مھجور منزل إلى العنوان قادھا\nً استشارت قصة. إخبار تحاول كأنھا غریب، بإیقاع تدق الساعة ً مؤرخا السجلات في البحث في ساعدھا الذي سلیم، الدكتور یدعى محلیا\n\nالصحف وأرشیف القدیمة .\n\nً اكتشفا كانت التحف. متجر الآن أصبح الذي المكان نفس - القدیم مكتبھ في بالتحدید الساعة تلك في قتُل بل یختف، لم التاجر أن معا\nیحمل الحي، نفس في یعیش یزال لا كان القاتل حفید أن ذلك، من والأغرب عاماً، سبعین منذ تُحل لم قتل جریمة على شاھدة الساعة",
    "content_en": "Nada bought an old brass pocket watch from an antique shop in old Damascus. The watch was beautiful with its intricate engravings and faded gold chain, but something strange was happening: every night at 11:17 PM, the watch would stop working for exactly one minute, then resume ticking as if nothing had happened.\n\nNada began researching the watch's history. She discovered it dated back to 1947 and belonged to a wealthy merchant named Faris Al-Mansour, who disappeared under mysterious circumstances. One day, while cleaning the watch, she noticed a tiny engraving hidden inside the back cover pointing to an address in the old city.\n\nThe address led her to an abandoned house in a narrow alley, its walls cracked and balconies eroded. There, at exactly 11:17, the watch began ticking in a strange rhythm, as if trying to tell a story. She consulted a local historian, Dr. Salim, who helped her search through old records and newspaper archives.\n\nTogether they discovered that the merchant hadn't disappeared but was murdered at that exact time in his old office - the same place that was now the antique shop. The watch had witnessed a murder unsolved for seventy years, and stranger still, the killer's grandson still lived in the same neighborhood, carrying a secret inherited from his grandfather."
  },
  {
    "id": "the-silent-neighbor",
    "title_en": "The Silent Neighbor",
    "title_ar": "الصامت الجار",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A suspenseful tale of suburban mystery that uncovers unexpected truths about appearances and judgment.",
    "content_ar": "ً انتقل الذي كمال، السید أشھر. منذ الغامض جاره یراقب عمر كان كانت النھار. خلال أبداً منزلھ یغادر لم الھادئ، الحي إلى حدیثا\nغریبة بأجھزة ملیئة - مختلفة كانت حدیقتھ حتى متأخرة. أوقات في غریبة طروداً یتلقى وكان اللیل، منتصف في فقط تشتعل الأضواء\n\nً تصدر اللیل في طنانة أصواتا .\n\nجاره تحركات عن ملاحظات ویدون صوراً یلتقط بدأ الأمر. في التحقیق الجریمة، بأفلام وشغفھ المراھق بفضولھ المدفوع عمر، قرر\nمعاطف یرتدون غامضین زواراً ویستقبل القبو، إلى ثقیلة صنادیق ویحمل الحدیقة، في نفسھ مع یتحدث كمال السید أن لاحظ اللیلیة.\n\nفتح عندما فوجئ جاره، غضب یواجھ أن من بدلاً وسقط. قدمھ انزلقت القبو، نافذة قرب یتسلل كان وبینما الماطرة، اللیالي إحدى في\nالمذھلة الحقیقة اكتشف وھناك، للدخول. ودعاه بابتسامة الباب كمال السید .\n\nً مرصداً یدیر مرموق فلك عالم كمال السید كان كانت الحدیقة في الأجھزة العمیق. الفضاء من غریبة إشارات یتتبع منزلھ، تحت سریا\nً بل مجرماً، یكن لم الفضاء. وكالة من علماء كانوا الغامضون والزوار متطورة، استشعار أجھزة اكتشاف وشك على منعزلاً عالما\nالأرض خارج حیاة علامات .",
    "content_en": "Omar had been watching his mysterious neighbor for months. Mr. Kamal, who recently moved to the quiet neighborhood, never left his house during daylight. The lights only came on at midnight, and he received strange packages at odd hours. Even his garden was different - filled with strange devices that hummed in the night.\n\nDriven by teenage curiosity and his love for crime movies, Omar decided to investigate. He started taking photos and making notes about his neighbor's nocturnal movements. He noticed Mr. Kamal talking to himself in the garden, carrying heavy boxes to the basement, and receiving mysterious visitors in black coats.\n\nOne rainy night, while sneaking near the basement window, he slipped and fell. Instead of facing his neighbor's anger, he was surprised when Mr. Kamal opened the door with a smile and invited him in. There, he discovered the astounding truth.\n\nMr. Kamal was a prominent astronomer running a secret observatory beneath his house, tracking strange signals from deep space. The devices in the garden were sophisticated sensors, and the mysterious visitors were scientists from the space agency. He wasn't a criminal, but a reclusive scientist on the verge of discovering signs of extraterrestrial life."
  },
  {
    "id": "the-sapphire-heist",
    "title_en": "The Sapphire Heist",
    "title_ar": "سرقة الياقوت الأزرق",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A sophisticated heist story that explores the consequences of greed and the supernatural.",
    "content_ar": "ً لیلى تواجھ لم السرقة، في مھاراتھا كل رغم ً یوما ً نادراً أزرق حجراً كان البحر\". \"دمعة یاقوت مثل تحدیا المدینة، متحف في محفوظا\nالحجر واستبدال الأمنیة الأنظمة كل اختراق في نجحت الدقیق، التخطیط من شھور بعد لكن متطورة. إنذار وأنظمة مشددة حراسة تحت\n\nمزیفة بنسخة الأصلي .\n\nمالح ماء قطرات رأت المدینة. بوسط شقتھا في البحر أمواج صوت على استیقظت الغریبة. الأحداث بدأت السرقة، بعد الأولى اللیلة في\nغامضة بقوة إلیھ جذبھا الیاقوت، عن الابتعاد حاولت كلما المحیط. أعماق من ینادیھا غرقى عن غریبة وأحلام الجدران، على تتشكل .\n\nمأساویاً. مصیراً واجھ سرقھ من وكل غارقة، ملكة تاج من جزءاً الیاقوت كان قدیمة. أسطورة واكتشفت الحجر، تاریخ في بحثت\nواحداً یختفون بدأوا المقربین أصدقاؤھا حتى بالماء. تتعلق غامضة حوادث في ماتوا المحتملین المشترین كل لكن الحجر، بیع حاولت\n\nالآخر تلو .\n\nً كانت بل كریم، حجر مجرد یكن لم الیاقوت أن لتكتشف أسراره، لمغامرة بدایة مجرد كانت سرقتھ وأن الماء، تحت غامض لعالم مفتاحا\nتخیلت مما بكثیر أكبر .",
    "content_en": "Despite all her theft skills, Layla had never faced a challenge like the \"Sea's Tear\" sapphire. It was a rare blue stone kept in the city museum, under heavy guard and sophisticated alarm systems. But after months of meticulous planning, she succeeded in bypassing all security systems and replacing the original stone with a fake.\n\nOn the first night after the theft, strange events began. She awoke to the sound of ocean waves in her downtown apartment. She saw saltwater droplets forming on the walls, and strange dreams of drowned people calling her from the ocean depths. Every time she tried to distance herself from the sapphire, it drew her back with a mysterious force.\n\nShe researched the stone's history and discovered an ancient legend. The sapphire was part of a drowned queen's crown, and everyone who stole it met a tragic fate. She tried to sell the stone, but all potential buyers died in mysterious water-related accidents. Even her close friends began disappearing one after another.\n\nLayla realized she was trapped. Either return the stone and face prison, or keep it and face its curse. In a moment of desperation, she decided to dive deep into its secrets, only to discover that the sapphire wasn't just a gemstone, but a key to a mysterious underwater world, and its theft was just the beginning of an adventure far bigger than she had imagined."
  },
  {
    "id": "the-shadow-on-the-stairs",
    "title_en": "The Shadow on the Stairs",
    "title_ar": "الظل على الدرج",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A haunting tale of family secrets, guilt, and the supernatural that blurs the line between past and present.",
    "content_ar": "خطوات وقع تسمع صباحاً، الثالثة الساعة تمام في لیلة، كل جدتھا. عن ورثتھ الذي القدیم المنزل في كابوس إلى تتحول رنا لیالي بدأت\nالباب، تفتح عندما لكن غرفتھا. باب عند تتوقف ثم الأخرى، تلو درجة تصعد متأنیة، بطیئة، خطوات صوت القدیم. الخشبي الدرج على\n\nأحداً تجد لا .\n\nلكن القدیمة. الخشبیة الأرضیة في خلل أي عن للكشف خبیراً واستدعت مراقبة، كامیرات ركبت البدایة. في الأمر تجاھل حاولت\nعائلتھا وماضي المنزل تاریخ في تبحث بدأت لیلة. كل الخطوات استمرار رغم شیئاً، تلتقط لم الكامیرات .\n\nفي صغیرة فتاة اختفت عاماً، خمسین قبل مظلم: سر عن المصفرة الصفحات كشفت جدتھا. یومیات وجدت العلیة، في قدیم صندوق في\nیعثر ولم اختفت اللیالي، إحدى في المریضة. لأمھا دواء لتجلب لیلة كل الدرج تصعد كانت الیومیات، وحسب الخادمة، ابنة كانت المنزل.\n\nأبداً علیھا .\n\nإحدى وفي الصغیرة. الفتاة بحضور تشعر لیلة، كل الخطوات تنتظر أصبحت نفسھا. في تغیرات تلاحظ رنا بدأت القصة، في تعمقھا مع\nً نفسھا لتجد تتوقف، أن قبل الباب فتحت الخطوات. تتبع أن قررت اللیالي، قد الفتاة تكن لم لھا: مستعدة تكن لم حقیقة مع لوجھ وجھا\n\nالحقیقة یكشف من تنتظر تُحل، لم لجریمة صدى الخطوات وكانت اختفائھا، في ید للعائلة كان بل اختفت، .",
    "content_en": "Rana's nights began turning into a nightmare in the old house she inherited from her grandmother. Every night, at exactly 3 AM, she would hear footsteps on the old wooden staircase. Slow, deliberate footsteps, climbing one step at a time, then stopping at her bedroom door. But when she opened the door, no one was there.\n\nShe tried ignoring it at first. She installed security cameras and called an expert to check for any defects in the old wooden flooring. But the cameras captured nothing, despite the footsteps continuing every night. She began researching the house's history and her family's past.\n\nIn an old box in the attic, she found her grandmother's diaries. The yellowed pages revealed a dark secret: fifty years ago, a little girl disappeared in the house. She was the maid's daughter, and according to the diaries, she would climb the stairs every night to fetch medicine for her sick mother. One night, she vanished and was never found.\n\nAs she delved deeper into the story, Rana began noticing changes in herself. She started waiting for the footsteps each night, feeling the little girl's presence. One night, she decided to follow the footsteps. She opened the door before they stopped, finding herself face to face with a truth she wasn't ready for: the girl hadn't just disappeared, but the family had played a role in her disappearance, and the footsteps were echoes of an unsolved crime, waiting for someone to uncover the truth."
  },
  {
    "id": "the-hidden-trail",
    "title_en": "The Hidden Trail",
    "title_ar": "الخفي الدرب .1",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A tale of discovery and wonder as a hiker finds an ancient village preserved in time.",
    "content_ar": "الدرب ھذا لاستكشاف فضولھ دفعھ قبل. من یره لم الصخور بین ضیقًا مسارًا لمح عندما ھادئ خریفي یوم في الجبال یتسلق یامر كان\nصغیرة قریة مذھل: مشھد على فجأة المسار انفتح المشي، من ساعة وبعد العتیقة. الأشجار بین ملتویة منعطفات عبر فتبعھ الغامض،\n\nالزمن، في متجمدة وكأنھا القریة بدت الھواء. في خفیفًا دخانًا تنفث ومداخنھا قدیمة، حجریة بیوتھا الجبال، أحضان بین غافیة\nالحدیث العالم أعین عن بعیدًا بعنایة محفوظة .",
    "content_en": "On a quiet autumn day, Yamer was hiking in the mountains when he spotted a narrow path between the rocks he had never seen before. His curiosity drove him to explore this mysterious trail, following it through winding turns between ancient trees. After an hour of walking, the path suddenly opened to an astonishing sight: a small village nestled between the mountains, with old stone houses and chimneys gently puffing smoke into the air. The village seemed frozen in time, carefully preserved away from the eyes of the modern world."
  },
  {
    "id": "the-adventurous-compass",
    "title_en": "The Adventurous Compass",
    "title_ar": "المغامرة البوصلة .2",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A magical tale of a child's adventure with a mysterious compass.",
    "content_ar": "دائمًا وتشیر الأحمر باللون تتوھج كانت إبرتھا - العادیة البوصلات عن مختلفة كانت القدیم. جده صندوق في غریبة بوصلة سامي وجد\nمنزلھ، حدیقة عبر مثیرة رحلة في قادتھ والكنز. الخطر بین یجمع مكان إلى تشیر البوصلة أن سامي اكتشف متوقع. غیر اتجاه نحو\nجده ومذكرات القدیمة الذھبیة العملات من مجموعة على یحتوي صغیرًا صندوقًا وجد جذورھا وتحت قدیمة، شجرة إلى وصل حتى\n\n.المفقودة",
    "content_en": "Sami found a strange compass in his grandfather's old chest. It was different from ordinary compasses - its needle glowed red and always pointed in an unexpected direction. Sami discovered that the compass pointed to places where danger and treasure met. It led him on an exciting journey through his garden until he reached an old tree, and beneath its roots, he found a small box containing a collection of ancient gold coins and his grandfather's lost diaries."
  },
  {
    "id": "secrets-of-the-forgotten-island",
    "title_en": "Secrets of the Forgotten Island",
    "title_ar": "المنسیة الجزیرة أسرار .1",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A thrilling tale of survival and discovery when a ship's crew faces mysterious forces on an uncharted island.",
    "content_ar": "بشواطئھا الأولى، للوھلة جمیلة تبدو الجزیرة كانت عاتیة. عاصفة في سفینتھم غرق بعد مجھولة جزیرة شاطئ على البحارة استیقظ\nوأصوات الأشجار، بین تتراقص غامضة أضواء كانت اللیل، في وحدھم. لیسوا أنھم اكتشفوا ما سرعان لكن الكثیفة، وغاباتھا البیضاء\n\nالجزیرة أرجاء في تتردد غریبة .",
    "content_en": "The sailors awoke on the shore of an unknown island after their ship sank in a violent storm. The island appeared beautiful at first glance, with its white beaches and dense forests, but they soon discovered they weren't alone. At night, mysterious lights danced between the trees, and strange sounds echoed across the island.\n\nThe crew's captain, Ahmed, found ancient inscriptions on the walls of a nearby cave. The inscriptions told the story of an ancient civilization that lived on the island and suddenly disappeared due to a supernatural force. As days passed, the sailors began noticing strange occurrences: tools moving by themselves, footprints appearing and disappearing in the sand, and whispers in the air.\n\nAhmed and his crew decided to explore the heart of the island, where they discovered an ancient temple covered in climbing vines. Inside the temple, they uncovered the island's secret: it was home to spectral beings protecting an ancient treasure. As they came to understand the island's history and inhabitants, they learned to coexist with these beings until they could repair their ship and return home."
  },
  {
    "id": "the-magical-desert-pearl",
    "title_en": "The Magical Desert Pearl",
    "title_ar": "السحریة الصحراء لؤلؤة .2",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A merchant's race against time through the mystical desert in search of a legendary pearl.",
    "content_ar": "ً الشاسعة الصحراء عبر بالمخاطر محفوفة رحلة في كریم التاجر انطلق تمنح اللؤلؤة ھذه إن الأساطیر تقول أسطوریة. لؤلؤة عن بحثا\nالصیف لیلة في القمر اكتمال قبل علیھا العثور یجب لكن واحدة، أمنیة تحقیق على القدرة حاملھا .\n\nالأصعب لكن الكنز. نفس عن یبحثون طرق وقطاع خادعة، وواحات عاتیة، رملیة عواصف رحلتھ: في التحدیات من العدید كریم واجھ\nعلیھا للحصول یسعى من كل نوایا یختبر قدیم عفریت - اللؤلؤة حارس مواجھة علیھ كان كلھ ذلك من .\n\n\"ما لغزاً: علیھ طرح الذي العفریت واجھ الكریستال. من جبل قلب في اللؤلؤة مخبأ إلى كریم وصل القمر، اكتمال قبل الأخیرة اللحظة في\nاستخدامھا قرر كریم لكن اللؤلؤة، وسلمھ العفریت ابتسم \"السعادة\". كریم: أجاب الآخرین؟\" مع تشاركھ عندما قیمة یزداد الذي\n\nالشخصیة رغباتھ تحقیق من بدلاً الجفاف، من تعاني كانت التي قریتھ لمساعدة .",
    "content_en": "Merchant Kareem embarked on a perilous journey across the vast desert in search of a legendary pearl. Legends say this pearl grants its bearer one wish, but it must be found before the full moon on a summer night.\n\nKareem faced many challenges on his journey: violent sandstorms, deceptive oases, and bandits searching for the same treasure. But the most difficult of all was facing the pearl's guardian - an ancient djinn who tests the intentions of all who seek it.\n\nIn the final moment before the full moon, Kareem reached the pearl's hiding place in the heart of a crystal mountain. He faced the djinn who posed a riddle: \"What becomes more valuable when shared with others?\" Kareem answered: \"Happiness.\" The djinn smiled and handed him the pearl, but Kareem decided to use it to help his drought-stricken village, rather than fulfill his personal desires."
  },
  {
    "id": "pirates-of-the-sky",
    "title_en": "Pirates of the Sky",
    "title_ar": "السماء قراصنة .1",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "An orphan's thrilling journey with a crew of sky pirates that challenges their understanding of loyalty and justice.",
    "content_ar": "یظنھا كان ضخمة ھوائیة سفینة إلى تسلل عندما متوقع غیر موقف في نفسھ على عاماً، عشر الخمسة ذو الیتیم الفتى یاسین، عثر\nً اكتشف عادیة. شحن سفینة مجرد سارة القائدة بقیادة الفجر\" \"نسور طاقم - المنطقة في السماء قراصنة أشھر إلى تنتمي أنھا لاحقا\n\n.الجسورة\n\nجدارتھ لیثبت فرصة منحھ قررت طاقمھا. قلوب في تشتعل التي ذاتھا المغامرة شرارة عینیھ في سارة رأت السفینة، من إلقائھ من بدلاً\nأن كان تعلمھ درس أھم لكن بالسیف. والقتال البخاریة، المحركات وإصلاح الجویة، الملاحة فنون یاسین تعلم الطاقم. في كعضو\n\nالظلم وجھ في ویقفون المحتاجین، ویساعدون الفقراء، من یسرقون لا صارمة: شرف مدونة یتبعون القراصنة .\n\nالمخاطرة یاسین قرر العائمة. المدن في الغذاء إمدادات لاحتكار یخطط ثري تاجر خطیرة: مؤامرة الطاقم اكتشف الأخیرة، مھمتھم في\nعن مسؤولاً كان التاجر - صادمة حقیقة لھ كشفت لكنھا المھمة، نجحت تدینھ. التي الوثائق وسرقة التاجر قلعة إلى للتسلل بحیاتھ\n\nسنوات قبل عائلتھ قتل الذي الأیتام دار حریق .",
    "content_en": "Yaseen, a fifteen-year-old orphan, found himself in an unexpected situation when he snuck aboard a massive airship he thought was just an ordinary cargo vessel. He later discovered it belonged to the region's most famous sky pirates - the Dawn Eagles crew, led by the fearless Captain Sara.\n\nInstead of throwing him overboard, Sara saw in his eyes the same spark of adventure that burned in her crew's hearts. She decided to give him a chance to prove his worth as a crew member. Yaseen learned the arts of aerial navigation, steam engine repair, and sword fighting. But the most important lesson he learned was that pirates follow a strict code of honor: never steal from the poor, help those in need, and stand against injustice.\n\nOn their latest mission, the crew discovered a dangerous conspiracy: a wealthy merchant planning to monopolize food supplies in the floating cities. Yaseen decided to risk his life to infiltrate the merchant's fortress and steal incriminating documents. The mission succeeded, but it revealed a shocking truth - the merchant was responsible for the orphanage fire that killed his family years ago."
  },
  {
    "id": "the-wondrous-crystal-valley",
    "title_en": "The Wondrous Crystal Valley",
    "title_ar": "العجیب البلور وادي .2",
    "genre": "Fiction",
    "sub_genre": "Adventure",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "An explorer's journey through a mesmerizing valley where magical crystals hold ancient secrets and dangerous powers.",
    "content_ar": "الشفاف الكریستال من جبال خلاباً: المشھد كان موقعھ. عن البحث من سنوات عشر بعد المحرم البلور وادي لیلى المستكشفة دخلت\nالظلام في خافت بضوء تشع غریبة ومخلوقات الكریمة، الأحجار من ثماراً تحمل وأشجار قزح، قوس بألوان تتلألأ .\n\nالوادي، في خطوة كل مع عقود. قبل الوادي ھذا في اختفت التي الشھیرة العالمة جدتھا، عن ورثتھا قدیمة خریطة تحمل لیلى كانت\nرؤى لھم وتكشف الوادي، أعماق إلى المستكشفین تجذب غامضة، بطاقة تنبض البلورات كانت ھنا. الكثیرین اختفاء سبب تفھم بدأت\nوالمستقبل الماضي من .\n\nً معبداً لیلى اكتشفت الوادي، قلب في ً قدیما - الكریستال في محفورة جدتھا یومیات وجدت جدرانھ، على الأسود. البلور من بالكامل مبنیا\nصعباً: خیاراً لیلى واجھت أسراره. لحمایة الوادي في البقاء وقررت قدیمة، حضارة معرفة على تحتوي البلورات أن اكتشفت قد كانت\nقوتھ في الطامعین من الوادي أسرار لحمایة جدتھا مثل البقاء أو العالم، إلى المذھل الاكتشاف بھذا العودة .",
    "content_en": "Explorer Layla entered the forbidden Crystal Valley after ten years of searching for its location. The scene was breathtaking: mountains of transparent crystal shimmering with rainbow colors, trees bearing gemstone fruits, and strange creatures glowing dimly in the darkness.\n\nLayla carried an ancient map inherited from her grandmother, a famous scientist who disappeared in this valley decades ago. With each step in the valley, she began to understand why so many had vanished here. The crystals pulsed with mysterious energy, drawing explorers into the valley's depths, revealing visions of the past and future.\n\nAt the valley's heart, Layla discovered an ancient temple built entirely of black crystal. On its walls, she found her grandmother's journals etched into the crystal—she had discovered that the crystals contained the knowledge of an ancient civilization and decided to stay in the valley to protect its secrets. Layla faced a difficult choice: return to the world with this amazing discovery, or stay like her grandmother to protect the valley's secrets from those who would abuse its power."
  },
  {
    "id": "the-whispering-doll",
    "title_en": "The Whispering Doll",
    "title_ar": "الھامسة الدمیة .1",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A chilling tale of a child's doll that harbors dark secrets.",
    "content_ar": "عن صغیرة أسراراً تردد خافتة، الھمسات كانت البدایة، في اللیل. في ھمساتھا تسمع بدأت حتى كثیراً، الجدیدة دمیتھا تحب سارة كانت\nً أكثر الھمسات أصبحت الوقت، مرور مع لكن سارة. یومیات أسراراً - معرفتھا لأحد یمكن لا أشیاءً تعرف الدمیة كانت وإزعاجاً. وضوحا\n\nوتھمس: غریبة، ابتسامة تبتسم سریرھا، بجانب جالسة الدمیة لتجد سارة استیقظت مظلمة، لیلة وفي قلبھا. أعماق في سارة دفنتھا\nبھا لأخبرك الأسرار من المزید \"لدي .\"",
    "content_en": "Sarah loved her new doll dearly, until she started hearing its whispers at night. At first, the whispers were faint, repeating small secrets about Sarah's daily life. But as time passed, the whispers became clearer and more disturbing. The doll knew things no one could know—secrets Sarah had buried deep in her heart. One dark night, Sarah woke to find the doll sitting beside her bed, smiling an odd smile, whispering, \"I have more secrets to tell you.\"",
    "audio_ar_male": "assets/data/audio/whispering-doll_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/whispering-doll_ar_female.mp3"
  },
  {
    "id": "the-shadow-in-the-mirror",
    "title_en": "The Shadow in the Mirror",
    "title_ar": "المرآة في الظل .2",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A haunting tale of a mysterious shadow that defies reality.",
    "content_ar": "ً لاحظ الأیام، من یوم في لكن ذقنھ. لیحلق الحمام مرآة أمام أحمد یقف صباح، كل ً شیئا ً ظلاً - غریبا في لھ. ینتمي لا المرآة في إضافیا\nً یقترب بدأ لكنھ المرآة، خلفیة في بعیداً الظل كان البدایة، الجدیدة المرآة في ظھر الظل لكن المرآة، تغییر أحمد حاول یوم. بعد یوما\n\nً الظل أصبح السابع، الیوم صباح وفي أیضاً. رقبتھ على الباردة بأنفاسھ أحمد شعر حتى جداً، قریبا .",
    "content_en": "Every morning, Ahmed stands before his bathroom mirror to shave. But one day, he noticed something strange—an extra shadow in the mirror that didn't belong to him. At first, the shadow was distant in the mirror's background, but it began moving closer day by day. Ahmed tried changing the mirror, but the shadow appeared in the new one too. On the morning of the seventh day, the shadow had come so close that Ahmed felt its cold breath on his neck.",
    "audio_ar_male": "assets/data/audio/shadow-in-mirror_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/shadow-in-mirror_ar_female.mp3"
  },
  {
    "id": "the-phantom-passenger",
    "title_en": "The Phantom Passenger",
    "title_ar": "الشبح الراكب .1",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A mysterious late-night encounter that challenges reality and haunts a taxi driver forever.",
    "content_ar": "المطر وكان ساعات، قبل اللیلیة العمل نوبة بدأ قد كان الھادئة. المدینة شوارع في الأجرة سیارة یقود خالد كان باردة، شتویة لیلة في\nً السیارة، زجاج على یتساقط الخفیف ً جواً مضیفا المھجورة الشوارع على كئیبا .",
    "content_en": "On a cold winter night, Khaled was driving his taxi through the quiet city streets. He had started his night shift hours ago, and a light rain was falling on the car's windshield, adding a gloomy atmosphere to the deserted roads.\n\nAt exactly midnight, the car's digital clock suddenly stopped. At that moment, Khaled spotted a man wearing a black coat standing in the darkness, signaling him to stop. The passenger's face was unnaturally pale, and his clothes seemed old-fashioned, as if from the 1950s.\n\nThe passenger requested a ride to the old city cemetery. During the journey, Khaled noticed several disturbing things: the man's reflection did not appear in the rearview mirror, his breath left no fog on the window despite the cold, and his voice seemed to come from far away.\n\nThe passenger told a strange story about a car accident that happened on this exact night fifty years ago. He was the driver, and in an attempt to avoid a child, he swerved off the road and crashed. \"Every year, on the same night, I try to return to the cemetery... to thank the child who survived.\" When they reached the cemetery, Khaled turned to ask for the fare—but the back seat was empty, leaving only a patch of frost and an old funeral ticket dated fifty years ago.",
    "audio_ar_male": "assets/data/audio/phantom-passenger_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/phantom-passenger_ar_female.mp3"
  },
  {
    "id": "the-grinning-portrait",
    "title_en": "The Grinning Portrait",
    "title_ar": "المبتسم البورتریھ .2",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A seemingly innocent painting reveals a terrifying supernatural presence that threatens a family's sanity and safety.",
    "content_ar": "بعد أخیراً استسلم لكنھ بیعھا، في متردداً المتجر صاحب كان القدیم. المدینة حي في للتحف متجر من قدیمة لوحة العمري عائلة اشترت\nفي ویجلس أنیقة سوداء بدلة یرتدي وجھھ، على جاد بتعبیر الماضي القرن من نبیلاً رجلاً تصور اللوحة كانت محمد. الأب إصرار\n\nأحمر مخملي كرسي .\n\nً أن الصغرى، الابنة لیلى، لاحظت أسبوع، بعد لكن للمنزل. أنیقة إضافة وبدت المعیشة، غرفة في اللوحة علقوا فم زوایا - تغیر قد شیئا\nالبطيء التغییر یوثق للوحة، یومیة صوراً یلتقط بدأ أحمد أخاھا لكن أحد. یصدقھا لم البدایة، في قلیلاً. ترتفع بدأت الرجل .",
    "content_en": "The Al-Omari family bought an old painting from an antique shop in the old city district. The shop owner was hesitant to sell it but finally gave in after Mohammed, the father, insisted. The painting depicted a nobleman from the last century with a stern expression, dressed in an elegant black suit and seated in a red velvet chair.\n\nThey hung the painting in the living room, and it appeared to be a refined addition to the house. But after a week, Layla, the youngest daughter, noticed something had changed—the corners of the man's mouth were slightly raised. No one believed her at first, but her brother Ahmed started taking daily photos of the painting, documenting its slow transformation.\n\nNight by night, the faint smile grew into a ghastly grin revealing sharp teeth. The family began hearing distant laughter and footsteps in the hallway. The mother tried to remove the painting but suffered an icy burn on her hands. Mohammed hid the painting in the garage, yet it reappeared the next morning, back on the living room wall.\n\nOne night, they awoke to a deep, resonant laughter echoing through the house. Rushing to the living room, they found the painting empty—and the figure standing in the corner, grinning hideously. Old records revealed that the house once belonged to this very man a hundred years ago, and he was known for practicing dark magic."
  },
  {
    "id": "the-cold-room",
    "title_en": "The Cold Room",
    "title_ar": "الباردة الغرفة .1",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A haunting exploration of an impossible room that bridges our world with something ancient and malevolent.",
    "content_ar": "درجة تصل عندما حرارة، الصیف أیام أشد في حتى الطبیعة. قوانین كل تتحدى القبو في غرفة ھناك كانت القدیم، العائلة منزل في\nقیاس أجھزة جدوى. دون لكن الظاھرة، تفسیر والخبراء المھندسون حاول كالثلج. باردة الغرفة كانت مئویة، درجة أربعین إلى الحرارة\n\nالغیر البرد ھذا تفسیر عن عجزت الحدیثة التكنولوجیا الغرفة. دخولھا بمجرد العمل عن توقفت المراقبة وكامیرات تعطلت، الحرارة\n.طبیعي",
    "content_en": "In the old family house, there was a basement room that defied all laws of nature. Even on the hottest summer days, when temperatures reached forty degrees Celsius, the room remained ice-cold. Engineers and experts tried to explain the phenomenon but to no avail: thermometers malfunctioned, and surveillance cameras stopped working as soon as they entered. Modern technology simply couldn't account for the unnatural chill.\n\nWhen Samer inherited the house from his uncle, he set out to solve this mystery. As an archaeologist specializing in ancient civilizations, he suspected there was more going on than a mere temperature anomaly. He spent hours in the room, taking notes. Initially, he heard only faint whispers—barely audible. Over time, they became clearer. Strange inscriptions also began to form on the walls.\n\nThe writings were in ancient Sumerian. Gradually, Samer deciphered them. They spoke of a gateway between worlds and ancient beings trapped behind a thin veil of reality. He discovered that the house was built over a temple, and this room was a contact point with another realm. The cold was merely a side effect of these entities' presence.\n\nOn his final night of research, as the temperature plunged far below zero, the walls started to crack. New words glowed with a bluish light, and Samer heard a deep voice: \"At last, we have found someone who understands us. We have waited thousands of years.\" At that moment, Samer realized his translations had not been mere study—they were part of an ancient ritual to open the gateway."
  },
  {
    "id": "the-midnight-visitor",
    "title_en": "The Midnight Visitor",
    "title_ar": "اللیلي الزائر .2",
    "genre": "Fiction",
    "sub_genre": "Horror",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A terrifying entity stalks a small town, turning a simple act of answering the door into a deadly game of survival.",
    "content_ar": "ً اللیل، منتصف في الأبواب على طرقات قارسة. شتاء لیلة في الھادئة الصنوبر قریة في الغریبة الظاھرة بدأت الساعة تمام في دائما\nالمبلل التراب رائحة تشبھ غریبة ورائحة خالیة منازل خلفھم تاركین أثر، دون یختفون أبوابھم یفتحون الذین وھؤلاء عشرة. الثانیة .",
    "content_en": "The strange phenomenon began in the quiet village of Al-Sanoubar on a bitter winter night—knocks on doors at exactly midnight. Those who answered vanished without a trace, leaving behind empty houses and a damp, earthy smell.\n\nSana, a history teacher at the local high school, was the first to connect the dots. She noticed a pattern in the disappearances, as though the knocks followed an ancient map. While researching the village's archives, she uncovered a horrifying legend of an old ritual demanding human sacrifices to appease an entity beneath the earth.\n\nAs her turn approached, Sana spent her nights studying old manuscripts. She realized the knocks were not an invitation but a test. Anyone who opened the door was accepting an unseen summons into darkness.\n\nWhen the knocks finally came at her door, Sana did not open it. Instead, she stood silently, reciting a powerful incantation she had discovered. Through the door, she heard a muffled shriek, and an unnatural cold crept across the threshold. By morning, the entity had left a single mark carved into her doorstep—a sign that she had survived. After that night, the midnight knocks ceased in Al-Sanoubar, though Sana knew the lurking presence hadn't vanished. It still waited, hoping the next person would open the door."
  },
  {
    "id": "the-farewell-letter",
    "title_en": "The Farewell Letter",
    "title_ar": "الوداع رسالة .1",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "An emotional discovery that bridges the gap between father and son on a momentous day.",
    "content_ar": "ً أحمد وجد زفافھ، یوم صباح في ً ظرفا ً قدیما ً الممیز والده خط كان القدیم. والده صندوق في مخبأ في \"لولدي، المظروف: على واضحا\nً وداع، دون والده رحل سنوات، خمس قبل زفافھ.\" یوم كلمات كانت الرسالة. فتح مرتجفتین، وبیدین أحمد. قلب في عمیقة فجوة تاركا\nإلى سنوات غضب تحول لحظة، في بعید. من ابنھ نمو یراقب كان وكیف رحیلھ أسباب فیھا یشرح والحكمة، والحب بالندم تفیض والده\nتفاھم دموع .",
    "content_en": "On his wedding morning, Ahmed found an old envelope hidden in his father's wooden chest. Written on it in his father's distinctive handwriting were the words: \"To my son, on his wedding day.\" Five years earlier, his father had left without saying goodbye, leaving an emptiness in Ahmed's heart. Trembling, he opened the letter. It was filled with regret, love, and wisdom—an explanation of why his father had gone, and how he had watched his son grow from afar. In that moment, years of resentment turned into tears of understanding."
  },
  {
    "id": "the-silent-promise",
    "title_en": "The Silent Promise",
    "title_ar": "الصامت الوعد .2",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A touching tale of friendship, loss, and redemption spanning years of silence.",
    "content_ar": "سامر شعر الصغیر. كریم شقیق غرق الأخیرة، السباحة رحلة في المأساوي. الحادث وقع حتى الطفولة منذ صدیقین وكریم سامر كان\nً وابتعد إنقاذه، یستطع لم لأنھ بالذنب عشر بعد الأمر. كلف مھما صدیقھ عائلة بحمایة سامر وعد افتراقھما، قبل صدیقھ. عن تدریجیا\n\nالصامت بوعده یفي سامر كان - مجھول مساعد ظھر مالیة، أزمة كریم عائلة واجھت عندما سنوات، .",
    "content_en": "Samer and Karim had been friends since childhood, until a tragic accident during their last swimming trip claimed the life of Karim's younger brother. Samer felt responsible for being unable to save him and slowly pulled away from Karim. Before their final parting, Samer promised he would always protect Karim's family no matter the cost. Ten years later, when Karim's family fell into financial hardship, an anonymous benefactor came to their rescue—Samer, fulfilling his silent promise."
  },
  {
    "id": "the-forgotten-song",
    "title_en": "The Forgotten Song",
    "title_ar": "المنسیة الأغنیة .1",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A personal journey of rediscovery through the echoes of a once-famous melody.",
    "content_ar": "ً سمع عندما القدیمة المدینة شوارع في یمشي كان الأخیر. ألبومھ فشل بعد سنوات، منذ العزف عن نادر توقف ً صوتا شاب - مألوفا\nً الجدیدة النسخة ھذه منحت كیف من مذھولاً یستمع، وقف تماماً. مختلفة بطریقة المطر\" \"حكایة القدیمة أغنیتھ یغني جدیدة روحا\n\n.لكلماتھ\n\nإن تقول وكانت السرطان، من علاجھا خلال المستشفى في تسمعھا كانت جدتھ. من الأغنیة تعلم الذي یاسر، الشاب، العازف على تعرف\nھذه لكن الموسیقى، إلى عاد یتخیلھا. لم بطرق الناس قلوب لمست كیف لیكتشف أغنیتھ، رحلة یتتبع نادر بدأ الأمل. منحتھا الأغنیة\n\nً لیس المرة السنین عبر أغنیتھ جمعتھا التي القصص لمشاركة بل الشھرة، عن بحثا .",
    "content_en": "Nader quit performing years ago after his last album flopped. While walking through the old city, he heard a familiar voice—a young musician was singing his old song, \"Tale of Rain,\" in a totally new style. Stunned, he listened to how this version breathed new life into his lyrics.\n\nHe met the performer, Yasser, who had learned the song from his grandmother while she was undergoing cancer treatment. She said it gave her hope. Intrigued, Nader traced the journey of his song, discovering how it had resonated with people in ways he'd never imagined.\n\nHe returned to music, not for fame but to share the stories that had woven themselves into his song over the years."
  },
  {
    "id": "the-unfinished-quilt",
    "title_en": "The Unfinished Quilt",
    "title_ar": "المكتمل غیر اللحاف .2",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A family's journey of healing and connection through their grandmother's final project.",
    "content_ar": "ً خلفھا تركت سعاد، الجدة توفیت عندما تحمل قطعة وكل بعنایة، مرتبة الملونة القماش قطع كانت الخیاطة. غرفة في مكتمل غیر لحافا\nً اللحاف إكمال - ومریم سارة، نور، الثلاث: وبناتھا لیلى الأم - العائلة قررت خاصة. ذكرى حزنھن مع للتعامل كوسیلة معا .\n\nستائر من وقماش لنور، الأول المدرسة ثوب من وأخرى لیلى، زفاف فستان من قطعة جدیدة. قصة تنكشف كانت قماش، قطعة كل مع\nً یروین وھن والدموع الضحكات یتشاركن الخیاطة، طاولة حول یجتمعن النساء كانت مساء، كل القدیم. المنزل من یسمعنھا لم قصصا\n\n.قبل\n\nوكیف وحفیداتھا، لبناتھا أحلامھا عن تحكي كانت القماش. قطع بعض مع جدتھا خبأتھا صغیرة مذكرات الأخوات، أصغر مریم، اكتشفت\nیستمر حب غرزة، كل \"في أخیرة: رسالة وجدن اللحاف، زاویة وفي معاً. عائلتھا لنسج وسیلتھا اللحاف كان .",
    "content_en": "When Grandmother Suad passed away, she left behind an unfinished quilt in her sewing room. Each piece of fabric was carefully laid out, holding some special memory. The family—Layla (the mother) and her three daughters, Noor, Sarah, and Mariam—decided to finish the quilt together as a way to cope with their grief.\n\nEvery patch of cloth told a story: one from Layla's wedding dress, one from Noor's first school uniform, and another from the house's old curtains. Each evening, the women gathered around the sewing table, sharing laughter and tears as they unveiled tales none had heard before.\n\nMariam, the youngest sister, discovered small notes hidden among some fabric pieces. They contained their grandmother's hopes for her daughters and granddaughters, and how the quilt was her way of stitching the family together. In one corner, they found her final words: With every stitch, love goes on."
  },
  {
    "id": "the-rainy-reunion",
    "title_en": "The Rainy Reunion",
    "title_ar": "الأمطار لقاء .1",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A chance encounter brings hidden emotions to the surface as two former lovers face their shared past and uncertain future.",
    "content_ar": "خمس بعد المدینة إلى للتو عادت قد كانت المطر. توقف تنتظر قدیم، متجر مظلة تحت سلمى وقفت الخریف، أواخر من ممطر مساء في\nً سمعت فجأة، الخارج. في العمل من سنوات ً صوتا السابق وخطیبھا الأول حبھا ماجد، كان - مألوفا .",
    "content_en": "On a rainy evening in late autumn, Salma stood under the awning of a small shop, waiting for the downpour to ease. She had just returned to the city after five years abroad. Suddenly, she recognized a familiar voice—it was Majid, her first love and former fiancé.\n\nHe was also seeking shelter from the rain, looking just as surprised. Five years had passed since their difficult breakup, when Salma chose her career overseas instead of staying. As the rain intensified, they decided to duck into the nearby café—the same one where they'd first gotten to know each other.\n\nMemories flooded back: their laughter, their dreams for the future, and the small moments that had once bound them together. Majid admitted he'd quietly followed her career through mutual friends, proud of her accomplishments. Salma revealed she still carried their old photo in her wallet, wondering what might have been.\n\nWhile the rain pelted the streets, they realized they might still care for each other, though both had grown in different ways. They were no longer the same people they had been five years before—more mature, more understanding of life's demands. When the rain finally stopped, they exchanged phone numbers, not as ex-lovers yearning for the past, but as two people ready to see what the future might hold."
  },
  {
    "id": "the-missing-photograph",
    "title_en": "The Missing Photograph",
    "title_ar": "المفقودة الصورة",
    "genre": "Fiction",
    "sub_genre": "Drama",
    "level": "Advanced",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A stolen photograph leads a renowned photographer on a journey through memory and reconciliation.",
    "content_ar": "ً عشرین قبل التقطھا صورة - واحدة صورة سوى یسرقوا لم للتصویر، یوسف معرض لصوص اقتحم عندما بأیام. وفاتھا قبل لأمھ عاما\nلكن للكامیرا. غامضة ابتسامة تبتسم مشمسة، حدیقة في تجلس مسنة امرأة فیھا تظھر مجموعتھ، في شھرة الأكثر الصورة كانت\n\nً أمھ مع لھ ذكرى آخر كانت - فني عمل مجرد من أكثر كانت لیوسف، بالنسبة .",
    "content_en": "When thieves broke into Yousef's photo gallery, they took only one thing: a single photograph he had snapped twenty years ago, just days before his mother's death. It was his most renowned piece—an elderly woman sitting in a sunlit garden with a mysterious smile. To Yousef, it was more than art; it was his last link to his mother.\n\nDetermined to recover it, Yousef followed every lead, venturing into the world of secretive art collectors. He discovered that the thief was a wealthy enthusiast obsessed with his portfolio. Digging deeper, Yousef unearthed surprising truths.\n\nIn the office of the family lawyer, he found his mother's will—which he had never read. It revealed a hidden chapter: the garden in the photo belonged to another branch of the family, separated from his father long before he was born. In her final days, his mother had hoped to mend that old rift.\n\nEventually, he tracked the photograph to a house on the outskirts of town. There, he encountered an elderly uncle he had never known existed. The uncle had taken the photo not to steal it, but to restore it to the garden where it had once brought everyone together. By reclaiming it, Yousef also reclaimed a lost piece of his own history."
  },
  {
    "id": "recurring-dream",
    "title_en": "Recurring Dream",
    "title_ar": "المتكرر الحلم",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A psychological puzzle where dreams become a portal to uncover hidden truths.",
    "content_ar": "ً یركض كان قدیم. حجري بیت في غامض مغلق باب أمام نفسھ یجد مرة كل وفي ذاتھ، الحلم یرى أحمد كان أسبوع، لمدة لكن نحوه، دائما\n\nالباب. یفتح أن قبل یستیقظ كان .\n\nمنزل حول معلومات وجد عندما العائلیة، شجرتھ یدرس وھو بالدھشة شعر لكنھ فقط. حلم مجرد أنھ نفسھ یقنع أن أحمد حاول البدایة، في\nً حجري ً حلمھ في الذي المنزل وصف تماما فیھ یعش لم لكنھ موجوداً، المنزل كان عنھ. تحدث قد أحد یكن لم أجداده. لأحد قدیما عن أحد. أبدا\n\nً كان زیارتھ، یقرر أن قبل ً واضحا قدیمة عائلیة بأسرار مرتبط الحلم أن تماما .",
    "content_en": "For one week, Ahmed had been seeing the same dream. Each time, he found himself in front of a mysterious closed door in an old stone house. He was always running towards it, but would wake up just before opening the door.\n\nAt first, Ahmed tried to convince himself it was just a dream. But he was surprised while studying his family tree when he found information about an old stone house that belonged to one of his ancestors—it exactly matched the description of the house in his dream. No one had ever mentioned it to him. The house existed but no one had ever lived in it. Before he decided to visit it, he was certain the dream was connected to old family secrets.",
    "audio_ar_male": "assets/data/audio/recurring-dream_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/recurring-dream_ar_female.mp3"
  },
  {
    "id": "the-enchanted-mirror",
    "title_en": "The Enchanted Mirror",
    "title_ar": "المسحورة المرآة",
    "genre": "Fiction",
    "sub_genre": "Mystery",
    "level": "Intermediate",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A vintage mirror that reveals not reflections, but glimpses of a family's hidden history.",
    "content_ar": "كل البلدي. السوق في قدیمة تحف محل من غریبة فضیة بمرآة نور احتفظت والدتھا، عن ورثتھا التي القدیمة المقتنیات كل بین من\nً تظھر: المرآة كانت لیلة، منتصف في المرآة أمام نور تقف عندما أسبوع، ً صورا ً أناسا ً سمعت قدیمین، وملابس بتسریحات و وجوھا\nتظھر تكن لم لكنھا انعكاسھا، عن نور بحثت قدیمة. وأغاني بعیدة، موسیقى أصوات المرآة من خافتة .\n\nً نور اكتشفت البحث، من الكثیر وبعد الناس. ھؤلاء ھویة عن تبحث بدأت ملكھا في كانت عندما المرآة أن تظھر قدیمة صحف من قصاصا\nكانوا أشخاص یظھرون، الذین أولئك أن یعتقدون كانوا الناس وأن عاماً، ستین قبل جدتھا لعائلة مشھورة أرستقراطیة عائلة\n\nلھم حدثت كیف لكن قدیمة، جرائم بسبب خبأتھا أسراراً عائلتھا لدى أن نور فھمت مفقودة، حلقات نور جمعت بینما مختلفة. ظروف في .\n\nنفسھ الوقت في متواجدة فترتین بین الوصل حلقة یكون لوسیط، تحتاج الخجولة الحقیقة أن نور وأدركت یظھرون، كانوا من أرواح أن نور عرفت .",
    "content_en": "Among all the old possessions she inherited from her mother, Noor kept a strange silver mirror from an old antique shop in the city market. Every week, when Noor stood in front of the mirror at midnight, the mirror would show: images of people with old hairstyles and clothes, and she heard faint sounds of distant music and old songs coming from the mirror. Noor searched for her reflection, but it didn't appear.\n\nShe began researching who these people were. After much investigation, Noor discovered newspaper clippings showing that when the mirror was in her possession, it had belonged to a famous aristocratic family related to her grandmother sixty years ago. People believed that those who appeared were people who had been in different circumstances.\n\nAs Noor pieced together missing links, she understood that her family had secrets hidden because of old crimes. But how did they happen?\n\nNoor learned that the spirits of those who appeared were seeking justice. And Noor realized that the shy truth needed a medium—a link between two periods existing simultaneously.",
    "audio_ar_male": "assets/data/audio/enchanted-mirror_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/enchanted-mirror_ar_female.mp3"
  },
  {
    "id": "the-stopped-clock",
    "title_en": "The Stopped Clock",
    "title_ar": "المتوقفة الساعة",
    "genre": "Non-Fiction",
    "sub_genre": "Memoir",
    "level": "Beginner",
    "dialect": "Modern Standard Arabic",
    "summary_en": "A timeless reflection on the moments that shape our lives.",
    "content_ar": "في مھمة اتصالات یجري أبي كان عندما الساعة توقفت بالضبط. والنصف الثالثة الساعة عند جدي منزل في الكبیرة الساعة توقفت\nالعالم من الآخر الجانب .\n\nبذلك. سیشعر أنھ شك بلا اعتقد قلبھ. لمرض استسلم قد جدي كان بالضبط، والنصف الثالثة الساعة عند التالي، الیوم في\nالسنین مرور مع تغیرت الأشیاء من الكثیر البیت. أنحاء جمیع في العمل عن ساعة عشرون توقفت جدي، وفاة یوم في أنھ أمي أخبرتني\n\nوالنصف الثالثة الساعة عند متوقفة تزال لا الكبیرة الساعة لكن والداي، حتى شيء كل تغیر معاً. رحلة في وتأخذنا الذكریات تستحضر .",
    "content_en": "The large clock in my grandfather's house stopped at precisely 3:30. It stopped when my father was making important calls on the other side of the world.\n\nThe next day, at exactly 3:30, my grandfather had succumbed to heart disease. He undoubtedly believed he would feel it coming.\n\nMy mother told me that on the day of my grandfather's death, twenty clocks throughout the house stopped working. Many things changed over the years; everything changed, even my parents, but the big clock still remains stopped at 3:30, evoking memories and taking us on a journey together.",
    "audio_ar_male": "assets/data/audio/stopped-clock_ar_male.mp3",
    "audio_ar_female": "assets/data/audio/stopped-clock_ar_female.mp3"
  }
]
}