{
  "stories": [
    {
      "id": "the-tiny-dragon",
      "title_en": "The Tiny Dragon",
      "title_ar": "التنين الصغير",
      "genre": "Fantasy",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A heartwarming tale of a baby dragon's persistence in learning to breathe fire, teaching young readers about courage and determination.",
      "content_ar": "كان هناك تنين صغير يعيش مع عائلته في كهف عالٍ بين الجبال. حاول مراراً أن ينفث النار مثل والديه، لكنه لم ينجح سوى في إخراج دخان رمادي خفيف. شعر بالحزن والإحباط، لكنه لم يستسلم. في كل صباح، كان يقف أمام البحيرة ويتدرب. يوماً بعد يوم، أصبح الدخان أكثف وأدفأ. وفي صباح مشرق، وبينما كان يحاول للمرة الأولى، خرج من فمه لهب ذهبي صغير. فرح التنين الصغير وطار حول الكهف فخوراً بنفسه، وعلم أن الشجاعة الحقيقية تكمن في المثابرة.",
      "content_en": "There was a little dragon who lived with his family in a high cave among the mountains. He tried repeatedly to breathe fire like his parents, but only managed to produce light grey smoke. He felt sad and frustrated, but he didn't give up. Every morning, he would stand by the lake and practice. Day after day, the smoke became thicker and warmer. Then on one bright morning, while trying for the hundredth time, a small golden flame emerged from his mouth. The tiny dragon flew joyfully around the cave, proud of himself, and learned that true courage lies in persistence.",
      "audio_ar": "data/audio/the-tiny-dragon_ar.mp3",
      "audio_ar_male": "data/audio/the-tiny-dragon_ar_male.mp3",
      "audio_ar_female": "data/audio/the-tiny-dragon_ar_female.mp3"
    },
    {
      "id": "the-enchanted-forest",
      "title_en": "The Enchanted Forest",
      "title_ar": "الغابة المسحورة",
      "genre": "Fantasy",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A magical tale where a child discovers their heritage through an enchanted forest's ancient wisdom.",
      "content_ar": "دخلت ليلى الغابة الغريبة التي كانت تراها من نافذة غرفتها. بدأت الأشجار تتوهج بضوء أزرق خافت، وهمست بصوت عذب. حكت لها عن جدتها العظيمة التي كانت حكيمة القرية وحامية الغابة. استمعت ليلى بدهشة وهي تكتشف أن الحكمة تجري في عروقها. لمست شجرة عتيقة، فرأت صوراً من الماضي البعيد. فهمت الآن لماذا كانت دائماً تشعر بارتباط خاص مع الطبيعة. عادت إلى المنزل وفي قلبها فخر جديد بتراثها القديم.",
      "content_en": "Layla entered the strange forest she used to see from her bedroom window. The trees began to glow with a soft blue light and whispered in sweet voices. They told her about her great-grandmother, who was the village sage and protector of the forest. Layla listened in amazement as she discovered that wisdom ran in her veins. When she touched an ancient tree, she saw images from the distant past. She now understood why she had always felt a special connection with nature. She returned home with a new pride in her ancient heritage.",
      "audio_ar": "data/audio/the-enchanted-forest_ar.mp3",
      "audio_ar_male": "data/audio/the-enchanted-forest_ar_male.mp3",
      "audio_ar_female": "data/audio/the-enchanted-forest_ar_female.mp3"
    },
    {
      "id": "the-goblins-gold",
      "title_en": "The Goblin's Gold",
      "title_ar": "ذهب العفريت",
      "genre": "Fantasy",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A cleverly woven tale of deception and wisdom, teaching readers about the true nature of greed and its consequences.",
      "content_ar": "انتشرت في القرية الصغيرة الغريبة شائعات عن عفريت ماكر يخبئ كنزاً من الذهب في الكهوف القديمة. كان العفريت يظهر كل ليلة في الساحة، يلوح بقطع ذهبية براقة ويهمس بألغاز غامضة عن مكان الكنز. بدأ القرويون، المأخوذون بوعود الثراء، في تتبع إرشاداته الغامضة، متجاهلين تحذيرات كبير القرية الحكيم. قادتهم الألغاز عبر ممرات خطرة ومنحدرات حادة، حيث واجهوا اختبارات غريبة. في كل مرحلة، كان عليهم التخلي عن شيء ثمين: مجوهرات موروثة، خواتم زفاف، وحتى ذكريات سعيدة. كلما اقتربوا من هدفهم، زادت المخاطر وتعمقت خسائرهم. لم يدركوا أن العفريت كان يستمتع برؤيتهم يتصارعون مع جشعهم، يراقب كيف يتخلون عن أشياء لا تقدر بثمن مقابل وعود فارغة. في النهاية، وصلوا إلى غرفة واسعة مليئة بالمرايا السحرية، حيث رأى كل منهم انعكاساً لنفسه محملاً بالجشع والطمع. ضحك العفريت ضحكة عميقة وقال: \"الكنز الحقيقي هو الحكمة التي اكتسبتموها. الذهب يفنى، لكن الدروس تبقى. انظروا إلى ما فقدتم في سعيكم وراء الثراء.\" عاد القرويون إلى قريتهم أكثر حكمة، يحملون درساً لن ينسوه أبداً عن القيمة الحقيقية للأشياء.",
      "content_en": "In the small village, rumors spread about a cunning goblin who hid a treasure of gold in the ancient caves. The goblin would appear every night in the square, waving shining gold pieces and whispering mysterious riddles about the treasure's location. The villagers, captivated by promises of wealth, began following his cryptic instructions, ignoring the wise village elder's warnings. The riddles led them through dangerous passages and steep slopes, where they faced strange tests. At each stage, they had to give up something precious: inherited jewelry, wedding rings, and even happy memories. As they got closer to their goal, the dangers increased and their losses deepened. They didn't realize that the goblin was enjoying watching them struggle with greed, observing how they abandoned priceless things for empty promises. Finally, they reached a vast room filled with magical mirrors, where each saw a reflection of themselves burdened with greed and avarice. The goblin laughed deeply and said, \"The real treasure is the wisdom you've gained. Gold perishes, but lessons remain. Look at what you've lost in your pursuit of wealth.\" The villagers returned to their village wiser, carrying a lesson they would never forget about the true value of things.",
      "audio_ar_male": "data/audio/the-goblins-gold_ar_male.mp3",
      "audio_ar_female": "data/audio/the-goblins-gold_ar_female.mp3"
    },
    {
      "id": "the-starlight-beacon",
      "title_en": "The Starlight Beacon",
      "title_ar": "منارة ضوء النجوم",
      "genre": "Science Fiction",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A poignant tale of isolation and hope in deep space, exploring themes of cosmic connection.",
      "content_ar": "في أعماق الفضاء اللانهائي، طفر رايد افتراد من الفضاء أحمد وحيداً بعد انقطاع اتصاله مع محطته الرئيسية. كما كان يفقد الأمل، جهازه اخترق إشارات غريبة غامضة من علم عمري علم الفضاء. أكثر غريب، الإشارات كانت تدعو اسمه. كما اقترب من البهجة المشرقة، بدأت ترسل له رسائل عبر الإطلالة الغامضة، من اللغة التي يمكنه فهمها. اكتشف أنها تركته من المستكشفين القدامى لتوجيه الأشخاص المفقودين في الفضاء. شكراً لإحداثياته، أحمد كان قادراً على العودة إلى المنزل، حملاً معه السر الغامض للعلم المسحور.",
      "content_en": "In the infinite depths of space, astronaut Ahmed drifted alone after losing contact with his main station. As he was losing hope, his device picked up strange signals from an ancient space beacon. Even stranger, the signals were calling his name. As he approached the glowing beacon, it began sending him messages in a language he could understand. He discovered it was left by ancient explorers to guide those lost in space. Thanks to its coordinates, Ahmed was able to return home, carrying with him the secret of the mysterious beacon.",
      "audio_ar_male": "data/audio/the-starlight-beacon_ar_male.mp3",
      "audio_ar_female": "data/audio/the-starlight-beacon_ar_female.mp3"
    },
    {
      "id": "robo-companion",
      "title_en": "Robo-Companion",
      "title_ar": "الرفيق الآلي",
      "genre": "Science Fiction",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A heartwarming story about friendship and emotional growth between human and machine.",
      "content_ar": "اشترى والدا سارة روبوتاً تعليمياً معطوباً من متجر الإلكترونيات المستعملة. كان يتصرف بطريقة غريبة، يضحك في أوقات غير متوقعة، وأصبح حزيناً عندما حزنت سارة. بدلاً من إصلاحه، سارة حلت به كما هو. مع مرور الأيام، بدأ الروبوت ظهور مشاعر أكثر إنسانية في الأحداث. بدأت تهتم بأحساس سارة، وحاولت تهديءها عندما حزنت. سارة عرفت أن ما يبدو عليه عيبًا كان بالفعل بداية مبهجة كبيرة - روح تتعلم كيف تشعر.",
      "content_en": "Sarah's parents bought her a malfunctioning educational robot from a used electronics store. It behaved strangely, laughing at unexpected times and becoming sad when Sarah was sad. Instead of fixing it, Sarah decided to keep it as it was. As days passed, the robot began showing more human-like emotions. It started caring about Sarah's feelings and tried to cheer her up when she was sad. Sarah discovered that what seemed like a malfunction was actually the beginning of something beautiful - a soul learning how to feel.",
      "audio_ar_male": "data/audio/robo-companion_ar_male.mp3",
      "audio_ar_female": "data/audio/robo-companion_ar_female.mp3"
    },
    {
      "id": "quantum-key",
      "title_en": "The Quantum Key",
      "title_ar": "المفتاح الكمومي",
      "genre": "Science Fiction",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A mind-bending tale about a physicist who discovers a key that opens doors to parallel universes, forcing her to confront the consequences of her choices across multiple realities.",
      "content_ar": "اخترقت الدكتورة ريم، عالمة الفيزياء الكمومية، جهازاً غريباً يشبه المفتاح في مختبرها. أصدرت نبضات ضوئية غامضة عندما استخدمته لأول مرة، وأستجيبت لحقول الكمومية. عندما استخدمت المفتاح، اكتشفت عالمًا جديدًا: عالم حيث تزوجت أول حبيبة له، وآخر حيث أصبحت موسيقيًا بدلاً من عالمية. لكن مع كل رحلة، بدأت تلاحظ التشوهات في الواقع - كما لو أن الكون يحتجز على هذه التحولات الذرية. عرفت أن كل إصدار منها كان يدفع سعرًا مختلفًا لاختياراتها. في النهاية، واجهتها خيارً صعبًا: هل تستمر التصفح لهذه العوالم البديلة، أم تقبل الواقعية الحالية مع جميع عيوبها ومميزاتها؟",
      "content_en": "Dr. Reem, a quantum physicist, discovered a strange key-like device in her laboratory. It emitted fluctuating light pulses and responded to quantum fields. When she first used it, it opened a door to an alternative version of her world - one where she had made different life choices. With each use of the key, she discovered a new reality: a world where she married her first love, another where she became a musician instead of a scientist. But with each journey, she began noticing distortions in reality - as if the universe was protesting these dimensional jumps. She realized that each version of herself was paying a different price for her choices. In the end, she faced a difficult choice: should she continue exploring these alternative worlds, or accept her current reality with all its flaws and merits?",
      "audio_ar_male": "data/audio/quantum-key_ar_male.mp3",
      "audio_ar_female": "data/audio/quantum-key_ar_female.mp3"
    },
    {
      "id": "stopped-clock",
      "title_en": "The Antique Watch",
      "title_ar": "الساعة العتيقة",
      "genre": "Mystery",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A haunting mystery involving time, memory, and unsolved history.",
      "content_ar": "اشترت ندى ساعة جيب نحاسية قديمة من متجر للتحف في حي دمشق القديم. كانت الساعة جميلة بنقوشها المعقدة وسلسلتها الذهبية الباهتة، لكن شيئاً غريباً كان يحدث: كل ليلة عند الساعة 11:17 مساءً، تتوقف الساعة عن العمل لدقيقة واحدة بالضبط، ثم تستأنف دقاتها كأن شيئاً لم يكن. بدأت ندى تبحث في تاريخ الساعة. اكتشفت أنها تعود لعام 1947، وكانت ملكاً لتاجر ثري يدعى فارس المنصور، اختفى في ظروف غامضة. وفي أحد الأيام، وبينما كانت تنظف الساعة، لاحظت أن هناك نقشاً صغيراً مخفياً داخل الغطاء الخلفي يشير إلى عنوان في المدينة القديمة. قادها العنوان إلى منزل مهجور في زقاق ضيق، جدرانه متشققة وشرفاته متآكلة. وهناك، في تلك الساعة المحددة 11:17، بدأت الساعة تدق بإيقاع غريب، كأنها تحاول إخبار قصة. استشارت مؤرخاً محلياً يدعى الدكتور سليم، الذي ساعدها في البحث في السجلات القديمة وأرشيف الصحف. اكتشفا معاً أن التاجر لم يختف، بل قُتل في تلك الساعة بالتحديد في مكتبه القديم - نفس المكان الذي أصبح الآن متجر التحف. كان الساعة شاهدة على جريمة قتل لم تُحل منذ سبعين عاماً، والأغرب من ذلك، أن حفيد القاتل كان لا يزال يعيش في نفس الحي، يحمل سراً ورثه عن جده.",
      "content_en": "Nada bought an old brass pocket watch from an antique shop in old Damascus. The watch was beautiful with its intricate engravings and faded gold chain, but something strange was happening: every night at 11:17 PM, the watch would stop working for exactly one minute, then resume ticking as if nothing had happened. Nada began researching the watch's history. She discovered it dated back to 1947 and belonged to a wealthy merchant named Faris Al-Mansour, who disappeared under mysterious circumstances. One day, while cleaning the watch, she noticed a tiny engraving hidden inside the back cover pointing to an address in the old city. The address led her to an abandoned house in a narrow alley, its walls cracked and balconies eroded. There, at exactly 11:17, the watch began ticking in a strange rhythm, as if trying to tell a story. She consulted a local historian, Dr. Salim, who helped her search through old records and newspaper archives. Together they discovered that the merchant hadn't disappeared but was murdered at that exact time in his old office - the same place that was now the antique shop. The watch had witnessed a murder unsolved for seventy years, and stranger still, the killer's grandson still lived in the same neighborhood, carrying a secret inherited from his grandfather.",
      "audio_ar_male": "data/audio/stopped-clock_ar_male.mp3",
      "audio_ar_female": "data/audio/stopped-clock_ar_female.mp3"
    },
    {
      "id": "enchanted-mirror",
      "title_en": "The Enchanted Mirror",
      "title_ar": "المرآة المسحورة",
      "genre": "Fantasy",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A profound exploration of self-discovery through a magical mirror that shows people their true selves and potential futures.",
      "content_ar": "وجدت فاطمة مرآة قديمة في علية منزلها. كان إطارها مزيناً بنقوش غامضة وأحجار كريمة باهتة. عندما نظرت فيها، رأت نسخاً مختلفة من نفسها: طبيبة ناجحة، فنانة مشهورة، أماً لثلاثة أطفال. كل انعكاس كان يمثل مساراً مختلفاً لحياتها. بدأت تقضي ساعات أمام المرآة، تتأمل كل احتمال وتتساءل عن القرارات التي قادتها إلى حاضرها. لكن المرآة كشفت لها شيئاً أعمق: في كل انعكاس، كان هناك جوهر ثابت - روحها الحقيقية التي تتجاوز المظاهر والإنجازات. أدركت أن السعادة لا تكمن في المسار الذي نختاره، بل في كيفية عيشنا له.",
      "content_en": "Fatima found an ancient mirror in her house's attic. Its frame was adorned with mysterious engravings and faded gemstones. When she looked into it, she saw different versions of herself: a successful doctor, a famous artist, a mother of three. Each reflection represented a different path her life could have taken. She began spending hours in front of the mirror, contemplating each possibility and wondering about the decisions that led to her present. But the mirror revealed something deeper: in each reflection, there was a constant essence - her true spirit that transcended appearances and achievements. She realized that happiness doesn't lie in the path we choose, but in how we live it.",
      "audio_ar_male": "data/audio/enchanted-mirror_ar_male.mp3",
      "audio_ar_female": "data/audio/enchanted-mirror_ar_female.mp3"
    },
    {
      "id": "recurring-dream",
      "title_en": "The Recurring Dream",
      "title_ar": "الحلم المتكرر",
      "genre": "Mystery",
      "level": "Advanced",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A psychological mystery about a woman who discovers that her recurring dream holds the key to an unsolved family secret.",
      "content_ar": "لثلاثين عاماً، راود سلمى نفس الحلم: تجد نفسها في منزل جدتها القديم، تبحث عن شيء ما في غرفة مظلمة. في كل مرة، تستيقظ قبل أن تجد ما تبحث عنه. بعد وفاة جدتها، ورثت سلمى المنزل. وبينما كانت ترتب مقتنيات جدتها، وجدت مفتاحاً قديماً مخبأً في صندوق صغير. المفتاح بدا مألوفاً - كانت تراه في حلمها. قادها المفتاح إلى غرفة سرية في الطابق العلوي، حيث وجدت مجموعة من الرسائل والصور القديمة. كشفت الرسائل سراً عائلياً دفيناً: جدتها كانت تخفي هوية والدها الحقيقي، الذي كان فناناً مشهوراً اضطر للهرب من البلاد بسبب مواقفه السياسية. أدركت سلمى أن حلمها كان رسالة من اللاوعي، يحثها على كشف الحقيقة. الآن، وقد عرفت قصتها الكاملة، توقف الحلم أخيراً.",
      "content_en": "For thirty years, Salma had the same dream: she finds herself in her grandmother's old house, searching for something in a dark room. Each time, she wakes up before finding what she's looking for. After her grandmother's death, Salma inherited the house. While organizing her grandmother's belongings, she found an old key hidden in a small box. The key seemed familiar - she had seen it in her dream. The key led her to a secret room upstairs, where she found a collection of old letters and photographs. The letters revealed a buried family secret: her grandmother had been hiding the identity of her real father, who was a famous artist forced to flee the country due to his political views. Salma realized that her dream had been a message from her subconscious, urging her to uncover the truth. Now that she knew her complete story, the dream finally stopped.",
      "audio_ar_male": "data/audio/recurring-dream_ar_male.mp3",
      "audio_ar_female": "data/audio/recurring-dream_ar_female.mp3"
    },
    {
      "id": "whispering-doll",
      "title_en": "The Whispering Doll",
      "title_ar": "الدمية الهامسة",
      "genre": "Horror",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A chilling tale of a child's doll that harbors dark secrets.",
      "content_ar": "كانت سارة تحب دميتها الجديدة كثيراً، حتى بدأت تسمع همساتها في الليل. في البداية، كانت الهمسات خافتة، تردد أسراراً صغيرة عن يوميات سارة. لكن مع مرور الوقت، أصبحت الهمسات أكثر وضوحاً وإزعاجاً. كان الدمية تعرف أشياءً لا يمكن لأحد معرفتها - أسراراً دفنتها سارة في أعماق قلبها. وفي ليلة مظلمة، استيقظت سارة لتجد الدمية جالسة بجانب سريرها، تبتسم ابتسامة غريبة، وتهمس: \"لدي المزيد من الأسرار لأخبرك بها\".",
      "content_en": "Sarah loved her new doll dearly, until she started hearing its whispers at night. At first, the whispers were faint, repeating small secrets about Sarah's daily life. But as time passed, the whispers became clearer and more disturbing. The doll knew things no one could know - secrets Sarah had buried deep in her heart. One dark night, Sarah woke to find the doll sitting beside her bed, smiling an odd smile, whispering, \"I have more secrets to tell you.\"",
      "audio_ar_male": "data/audio/whispering-doll_ar_male.mp3",
      "audio_ar_female": "data/audio/whispering-doll_ar_female.mp3"
    },
    {
      "id": "shadow-in-mirror",
      "title_en": "The Shadow in the Mirror",
      "title_ar": "الظل في المرآة",
      "genre": "Horror",
      "level": "Beginner",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A haunting tale of a mysterious shadow that defies reality.",
      "content_ar": "كل صباح، يقف أحمد أمام مرآة الحمام ليحلق ذقنه. لكن في يوم من الأيام، لاحظ شيئاً غريباً - ظلاً إضافياً في المرآة لا ينتمي له. في البداية، كان الظل بعيداً في خلفية المرآة، لكنه بدأ يقترب يوماً بعد يوم. حاول أحمد تغيير المرآة، لكن الظل ظهر في المرآة الجديدة أيضاً. وفي صباح اليوم السابع، أصبح الظل قريباً جداً، حتى شعر أحمد بأنفاسه الباردة على رقبته.",
      "content_en": "Every morning, Ahmed stands before his bathroom mirror to shave. But one day, he noticed something strange - an extra shadow in the mirror that didn't belong to him. At first, the shadow was distant in the mirror's background, but it began moving closer day by day. Ahmed tried changing the mirror, but the shadow appeared in the new one too. On the morning of the seventh day, the shadow had come so close that Ahmed felt its cold breath on his neck.",
      "audio_ar_male": "data/audio/shadow-in-mirror_ar_male.mp3",
      "audio_ar_female": "data/audio/shadow-in-mirror_ar_female.mp3"
    },
    {
      "id": "phantom-passenger",
      "title_en": "The Phantom Passenger",
      "title_ar": "الراكب الشبح",
      "genre": "Horror",
      "level": "Intermediate",
      "dialect": "Modern Standard Arabic",
      "summary_en": "A mysterious late-night encounter that challenges reality and haunts a taxi driver forever.",
      "content_ar": "في ليلة شتوية باردة، كان خالد يقود سيارة الأجرة في شوارع المدينة الهادئة. كان قد بدأ نوبة العمل الليلية قبل ساعات، وكان المطر الخفيف يتساقط على زجاج السيارة، مضيفاً جواً كئيباً على الشوارع المهجورة. عند منتصف الليل بالضبط، توقفت ساعة السيارة الرقمية فجأة. في نفس اللحظة، لمح خالد رجلاً يرتدي معطفاً أسود يقف في الظلام، يشير له للتوقف. كان وجه الراكب شاحباً بشكل غير طبيعي، وملابسه تبدو قديمة الطراز، كأنها من خمسينيات القرن الماضي. طلب الراكب الذهاب إلى مقبرة المدينة القديمة. خلال الرحلة، لاحظ خالد عدة أمور مقلقة: الرجل لا ينعكس في المرآة الداخلية للسيارة، وأنفاسه لا تترك ضباباً على النافذة رغم البرد الشديد، وصوته يبدو وكأنه يأتي من مكان بعيد. بدأ الراكب يحكي قصة غريبة عن حادث سيارة وقع في نفس الليل قبل خمسين عاماً. كان هو السائق، وفي محاولة لتجنب طفلة عبرت الطريق فجأة، انحرف بسيارته واصطدم بشجرة. \"كل عام، في نفس الليل، أحاول العودة إلى المقبرة لأشكر الطفلة التي نجت\". عندما وصلا إلى المقبرة، التفت خالد للخلف ليطلب الأجرة، لكن المقعد الخلفي كان فارغاً، تاركاً فقط بقعة من الماء المتجمد وتذكرة جنازة صفراء قديمة تحمل تاريخ قبل خمسين عاماً بالضبط. وعلى مقبرة قريبة، رأى خالد صورة راكبه على شاهد القبر.",
      "content_en": "On a cold winter night, Khaled was driving his taxi through the quiet city streets. He had started his night shift hours ago, and a light rain was falling on the car's windshield, adding a gloomy atmosphere to the deserted streets. At exactly midnight, the car's digital clock suddenly stopped. At that moment, Khaled spotted a man wearing a black coat standing in the darkness, signaling him to stop. The passenger's face was unnaturally pale, and his clothes seemed old-fashioned, as if from the 1950s. The passenger requested to go to the old city cemetery. During the journey, Khaled noticed several disturbing things: the man had no reflection in the rearview mirror, his breath left no fog on the window despite the severe cold, and his voice seemed to come from far away. The passenger began telling a strange story about a car accident that happened on the same night fifty years ago. He was the driver, and in an attempt to avoid a child who suddenly crossed the road, he swerved and crashed into a tree. \"Every year, on the same night, I try to return to the cemetery... to thank the child who survived.\" When they reached the cemetery, Khaled turned back to ask for the fare, but the back seat was empty, leaving only a patch of frost and an old yellow funeral ticket dated exactly fifty years ago. On a nearby gravestone, Khaled saw his passenger's photo on the tombstone.",
      "audio_ar_male": "data/audio/phantom-passenger_ar_male.mp3",
      "audio_ar_female": "data/audio/phantom-passenger_ar_female.mp3"
    }
  ]
}